text/18-minijoy.org
#+title: Chapter 18 : A miniature version of Joy, a functional language

* <<intro>>

Joy is a purely functional language in the spirit of pure Lisp, pure Scheme, ML and Miranda.  But whereas these languages are based on the application of functions to parameters, Joy is based on the composition of functions.  Syntactically it looks much like Forth, and one consequence is that in Joy all formal parameters of defined functions are anonymous.  However, unlike Forth, Joy also has lists which can be manipulated as data structures and, provided they are of the right kind, can be executed as programs by means of what are called /combinators/

The implementation described in the latter sections of this chapter is quite minimal.  The implementation makes heavy use of the utilities developed in Chapter 17.

* Introduction

The first part of this introduction provides a theoretical nmotivation for the language, the second part gives a practical overview based on examples.

These two parts can be read in any order; theoretically minded readers should read the first part first, practically minded readers should read the second part first.

