18-minijoy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Chapter 18 : A miniature version of Joy, a functional language</title>
<!-- 2013-05-31 Fri 19:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="author" content="michal"/>
<link rel="stylesheet" type="text/css" href="/sympas/etc/style.css">
</head>
<body>
<div id="content">
<h1 class="title">Chapter 18 : A miniature version of Joy, a functional language</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. </a></li>
<li><a href="#sec-2">2. Introduction</a>
<ul>
<li><a href="#sec-2-1">2.1. Theoretical background</a></li>
<li><a href="#sec-2-2">2.2. Tutorial on Joy</a></li>
</ul>
</li>
<li><a href="#sec-3">3. The Joy language</a>
<ul>
<li><a href="#sec-3-1">3.1. Design principles</a></li>
<li><a href="#sec-3-2">3.2. The core language</a>
<ul>
<li><a href="#sec-3-2-1">3.2.1. <i>Pushing Data</i>:</a></li>
<li><a href="#sec-3-2-2">3.2.2. <i>Operators</i>:</a></li>
<li><a href="#sec-3-2-3">3.2.3. <i>Combinators</i>:</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-4">4. Standard library</a></li>
<li><a href="#sec-5">5. Theory of Joy</a>
<ul>
<li><a href="#sec-5-1">5.1. Joy algebra</a></li>
<li><a href="#sec-5-2">5.2. Joy types</a></li>
<li><a href="#sec-5-3">5.3. <i>Reading</i>:</a></li>
<li><a href="#sec-5-4">5.4. A Joy interpreter written in Joy</a></li>
</ul>
</li>
<li><a href="#sec-6">6. The implementation</a>
<ul>
<li><a href="#sec-6-1">6.1. <i>Declarations</i>:</a></li>
<li><a href="#sec-6-2">6.2. <i>Data Structures</i>:</a></li>
<li><a href="#sec-6-3">6.3. <i>Main</i>:</a></li>
<li><a href="#sec-6-4">6.4. <i>The interpreter</i>:</a></li>
<li><a href="#sec-6-5">6.5. <i>Input and Output</i>:</a></li>
<li><a href="#sec-6-6">6.6. <i>The kons function and garbage collection</i>:</a></li>
<li><a href="#sec-6-7">6.7. <i>Lookup</i>:</a></li>
</ul>
</li>
<li><a href="#sec-7">7. The program</a></li>
<li><a href="#sec-8">8. Exercises and Reading</a>
<ul>
<li><a href="#sec-8-1">8.1. <i>Algebra</i>:</a></li>
<li><a href="#sec-8-2">8.2. <i>Self-reproducing programs</i>:</a></li>
<li><a href="#sec-8-3">8.3. <i>Constructing Joy-in-Joy</i>:</a></li>
<li><a href="#sec-8-4">8.4. <i>Automatic printout</i>:</a></li>
<li><a href="#sec-8-5">8.5. <i>OOPS</i>:</a></li>
<li><a href="#sec-8-6">8.6. <i>Pretty Printing</i>:</a></li>
<li><a href="#sec-8-7">8.7. <i>Eliminating the dump</i>:</a></li>
<li><a href="#sec-8-8">8.8. <i>Implementing the library directly</i>:</a></li>
<li><a href="#sec-8-9">8.9. <i>Sets</i>:</a></li>
<li><a href="#sec-8-10">8.10. <i>Reals</i>:</a></li>
<li><a href="#sec-8-11">8.11. <i>Other memory management</i>:</a></li>
<li><a href="#sec-8-12">8.12. <i>Reading</i>:</a></li>
</ul>
</li>
<li><a href="#sec-9">9. Projects</a>
<ul>
<li><a href="#sec-9-1">9.1. Improving efficiency</a></li>
<li><a href="#sec-9-2">9.2. An imperative version of Joy</a></li>
<li><a href="#sec-9-3">9.3. A nondeterministic version of Joy</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> <a id="intro" name="intro"></a></h2>
<div class="outline-text-2" id="text-1">
<p>
Joy is a purely functional language in the spirit of pure Lisp, pure Scheme, ML and Miranda.  But whereas these languages are based on the application of functions to parameters, Joy is based on the composition of functions.  Syntactically it looks much like Forth, and one consequence is that in Joy all formal parameters of defined functions are anonymous.  However, unlike Forth, Joy also has lists which can be manipulated as data structures and, provided they are of the right kind, can be executed as programs by means of what are called <i>combinators</i>
</p>

<p>
The implementation described in the latter sections of this chapter is quite minimal.  The implementation makes heavy use of the utilities developed in Chapter 17.
</p>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
<p>
The first part of this introduction provides a theoretical nmotivation for the language, the second part gives a practical overview based on examples.
</p>

<p>
These two parts can be read in any order; theoretically minded readers should read the first part first, practically minded readers should read the second part first.
</p>
</div>
