18-minijoy.html

<div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> Theoretical background</h3>
<div class="outline-text-3" id="text-2-1">
<p>
In strongly typed languages the declaration of functions must include the types of the parameters and the type of the result.  For example, in Pascal one might have the following declarations for the length of a list and the concatenation of two lists:
</p>

<pre class="example">
FUNCTION length(l : list) : integer; BEGIN ... END;
FUNCTION concat(l1,l2 : list) : list; BEGIN ... END;
</pre>

<p>
Strong typing allows a compiler to check that all calls to declared functions and procedures are in agreement with the types.  In weakly typed languages the checking is only done at run time; in untyped languages there is no checking at all.  Independently of what kind of typing is used, the length function takes a list as a parameter and yields an integer as a result, and the concatenation function takes two lists as parameters and yields a list as the result.  This is normally written as type information
</p>

<pre class="example">
length  :  list --&gt; integer
concat  :  (list * list) --&gt; list
</pre>

<p>
Here the colon indicates that the function on its left is of the type indicated on its right.  A function type is given by an arrow from the source type of the parameters to the target type of the result.  For functions taking two or more parameters the source is a Cartesian product indicated by the <code>*</code>.
</p>

<p>
These type assignments to the two functions are entirely abstract, they have nothing to do with the concrete syntax.  For example, the length of the concatenation of the two lists <code>[a b]</code> and <code>[c d e]</code> could be written in any of the following ways:
</p>

<pre class="example">
length([a b] concat [c d e])
length concat [a b] [c d e]
(length (concat [a b] [c d e]))
length(concat([a b],[c d e]))
length @ (concat @ ([a b],[c d e]))
</pre>

<p>
In the last line the infix <code>@</code> is the explicit binary operation of function application; the function on its left is being applied to the parameter on its right.  For the application of concatenation the parameter is a pair.  Strictly speaking the words <code>length</code> and <code>concat</code> are used to denote functions as objects &#x2014; the only function that is being used is the binary application function, here written in infix, which takes two objects to produce a third.  Languages like this are sometimes called applicative languages (as opposed to functional languages).  There is an analogy with set theory here: whereas in predicate logic one uses all sorts of relations, in set theory the only relations used are <i>formal</i> ones such as membership and a few others such as inclusion which are definable in terms of membership.  So the predicate symbols of logic are replaced by names of set objects.  In the same way the function symbols of functional languages can be replaced by names of function objects, and the only function symbol needed is the symbol for the formal application function.  It is worth pointing out that membership is actually a special case of application &#x2014; membership always applies parameters to a set and always yields a truth value as the third object.  This might have been a little easier to see if the notation for membership were the other way around, or if membership were uniformly replaced by its converse.
</p>

<p>
Sometimes functions that take two or more parameters are interpreted as taking them one at a time &#x2014; they are then said to be <i>curried</i>.  The type assignments and the example expression now look like this:
</p>

<pre class="example">
concat  :  list --&gt; (list --&gt; list)
length @ ((concat @ [a b]) @ [c d e])
</pre>

<p>
So, concatenation is interpreted as taking a list as a parameter and yielding a value which is a function which takes a list as a parameter and yields a list as value.  The arrow is often made right-associative and then the parentheses can be omitted.  In the expression the inner parenthesised expression denotes a function which prefixes the list <code>[a b]</code> to any list to which it is applied, here to <code>[c d e]</code>.  The application symbol is often made left-associative, and then the inner parentheses in the expression can be omitted.  However, the outer parentheses cannot be omitted, as in
</p>

<pre class="example">
length @ concat @ [a b] @ [c d e]
</pre>

<p>
This is wrong because, restoring parentheses in accordance with the left-associativity of application, it would be the same as
</p>

<pre class="example">
(((length @ concat) @ [a b]) @ [c d e])
</pre>

<p>
But length cannot be applied to concatenation because of a type mismatch.
</p>

<p>
However, length can be <i>composed</i> with concatenation, and the result of composing these two functions is a function which takes two lists as parameters and yields an integer as value.  Writing <code>o</code> for composition of functions we have the type assignment and the expression maximally and minimally parenthesised:
</p>

<pre class="example">
length o concat  :  list --&gt; list --&gt; integer
(((length o concat) @ [a b]) @ [c d e])
   length o concat  @ [a b]  @ [c d e]
</pre>

<p>
Clearly composition has to have higher precedence than application.  So, for the expression we can at least sometimes avoid the need for parentheses by introducing a further symbol for function composition.  This works well when the function on the left takes one parameter.  For example, the function which gives the square of the length of the concatenation of two lists is given by the composition
</p>

<pre class="example">
square o length o concat
</pre>

<p>
Composition of functions is associative, hence no parentheses are needed.  When the above function is applied to one list, say <code>[a b]</code> it yields a function taking a list <code>L</code> as a parameter and giving as value <code>4 + (4 + length(L) * length(L)</code>.  If <code>L</code> is <code>[a b c]</code>, then the value is 25, as required.
</p>

<p>
There is something very satisfying about composition, it is associative and it has the identity function as the left and right identity element: If <code>id</code> is the identity function, then for any function <code>F</code>,
</p>

<pre class="example">
id o F  =  F  =  F o id
</pre>

<p>
It would be nice if the semantic binary operation and its identity element could be mapped onto an appropriate syntactic binary operation and its identity element.  Indeed, for functions taking one parameter and yielding one value the choice is obvious: function composition is mapped onto the concatenation of the sequence of symbols denoting the functions, and the identity functions is mapped onto the empty sequence of symbols.
</p>

<p>
However, this does not work if any but the rightmost function takes more than one parameter.  Clearly, instead of concatenating two lists, then taking the length and then the square, one could equivalently take the lengths of the two lists, take the sum of those, and then the square of that.
</p>

<pre class="example">
square o length o concat @ [a b] @ [c d e]
square o sum @ (length @ [a b]) @ (length @ [c d e])
</pre>

<p>
Now consider
</p>

<pre class="example">
square o + o length @ [a b] @ (length @ [c d e])
</pre>

<p>
We cannot write this, because there is no way in which the parenthesised part, the length of <code>[c d e]</code>, can be supplied as a parameter to sum because that is in the middle of the composition expression.  So it seems that there is no way to have less than the two operations of application and composition, and to dodge the need for parentheses.
</p>

<p>
This is all the more infuriating if we compare the notation using composition and application with ordinary Polish or prefix notation.  The two expressions are simply
</p>

<pre class="example">
square  length  concat  [a b]  [c d e]
square  +  length  [a b]  length  [c d e]
</pre>

<p>
Both of these are obviously concatenations of symbols, but what does the concatenation mean?
</p>

<p>
One possible answer is that it is just a bad question to ask about any notation.  For example, one would not ask this question about the infix notations
</p>

<pre class="example">
square length ([a b] concat [c d e])
square (length [a b]  +  length [c d e])
</pre>

<p>
The spaces around concat and around <code>+</code> do not stand for anything semantic, it is just a way of writing terms with two parameters.  It is the term that has semantic significance, and it has no concrete syntactic properties at all.  This applies to any concrete notation, and hence the concatenations in prefix notation do not mean anything either.
</p>

<p>
Another possible answer is that the concatenations in prefix notation sometimes mean composition and sometimes mean application.  In any one case the meaning depends on the number of parameters which the functions denoted require, and parentheses are restored as needed.  On this view, then, the prefix notation is just short for the versions given earlier:
</p>

<pre class="example">
square o length o concat @ [a b] @ [c d e]
square o sum @ (length @ [a b]) @ (length @ [c d e])
</pre>

<p>
But there is a third possible answer, and it is the one that will be pursued in the remainder of this chapter.  This is the answer that in the prefix notation the concatenation of symbols always means composition of functions.  This is a radical view because the functions being composed will <i>all</i> have to be unary functions.  In particular, concatenation and addition are unary and not binary, operands such as list and numerals are not nullary but unary.  On this view the prefix notation is shorthand for the composition of unary functions:
</p>

<pre class="example">
square o length o concat o [a b] o [c d e]
square o sum o length o [a b] o length o [c d e]
</pre>

<p>
Both simplify to the unary function 25.  The functions denoted by these compositions will have to be applied to some suitable objects.  When applied to the same objects, the applications result in further objects which are the same in both cases.  Moreover, the applications should result in the same object as when the unary function 25 is applied.  We do not have to say anything about the objects to which the functions are applied, they can be mystery objects <code>M</code>, <code>M1</code>, <code>M2</code> &#x2026;
</p>

<p>
Henceforth we omit the composition symbol <code>o</code> again, and remember that concatenation of symbols denotes composition of the unary functions denoted.  Hence we have, for all <code>M</code>, the applications
</p>

<pre class="example">
square length concat [a b] [c d e]   @   M
square sum length [a b] length [c d e]   @   M
25   @   M
</pre>

<p>
all denote the same mystery object, one that is different from <code>M</code>.  And because the applications all result in the same object, the composed functions themselves are identical.  On this view, then, computation takes unary functions as input and produces unary functions as output.  The mystery objects can remain mysterious unless making them explicit clarifies matters.
</p>

<p>
For long computations it is often helpful to be able to see the result of intermediate computations.  One starts with some input data, applies a partial computation and inspects the result.  If all went well one applies the next computation step to the result of the previous computation.  This continues until the whole computation is completed.  If at any time the result is not what was expected, one modifies the last computation step.  So the data come first, then comes computation step <code>S1</code>, &#x2026;  finally comes computation step <code>SN</code>:
</p>

<pre class="example">
D  S1  S2  ...  SN
</pre>

<p>
with inspection steps interspersed as required.  The same is true if there are several data, say <code>D1</code> and <code>D2</code> that both have to be processed individually first, then combined, and the result processed further:
</p>

<pre class="example">
D1  S1  D2  S3  S4  S5
</pre>

<p>
again with optional inspections.  But this is essentially postfix notation.  It is a big advantage if a notation allows inspections to be interspersed with computations without affecting the order in which the inspections are written.  For this reason we shall now reverse the notation and use postfix notation.  The two expressions are then written
</p>

<pre class="example">
[a b]  [c d e]  concat  length  square
[a b]  length  [c d e]  length  +  square
</pre>

<p>
As before, the concatenation between symbols denotes composition of unary functions, but composition is now written in reverse order.  This way all functions are written in the order they are to be applied to mystery objects.  The unary functions take one mystery object as parameter and return one such object as value.  For the version of the language to be developed here, the mystery objects consist of one stack, one input file and one output file.  Further parts are possible, but the topic is not pursued further.
</p>

<p>
One advantage of mapping composition onto concatenation is that it becomes easy to manipulate programs as data and then to execute them with <i>combinators</i>.  The simplest combinator is <code>i</code> which effectively removes brackets and executes what is inside.  For example, all of the following are equivalent to 25:
</p>

<pre class="example">
[a b] [c d e] concat length square
[a b] [c d e] [concat length square] i
[[a b] [c d e] concat length square] i
[a b] [c d e] [concat] [length square] concat i
[a b] [c d e] [square length concat] reverse i
</pre>

<p>
Combinators can be used to apply a function in non-standard ways.  For example the following use the <code>map</code> combinator:
</p>

<pre class="example">
[1 2 3 4]  [square square]  map    ==   [1 16 81 256]
[[a b] [c d e]] [first] map   ==   [a c]
</pre>

<p>
Much of the interest in Joy arises from combinators,
even more so than in other functional languages.

</p>
</div>
</div>
