text/18-minijoy.org
* The Joy language

This section develops the design principles of the Joy language up to a full definition.

** Design principles
In several languages, notably Lisp, Snobol and Prolog, programs and data have the same structure, as summarised by the slogan

#+begin_example
                Program  =  Data
#+end_example

In addition they use internal memory which has a quite different structure.  In Joy the identification is carried one step further: the internal memory also has that same structure

#+begin_example
                Program  =  Data  =  Memory
#+end_example

In Joy programs are lists, data are atoms or lists, and the working memory is a stack which is also a list.

Joy was designed to make its semantics as simple as possible.  The semantics of any language is given by a function which assigns meanings to the basic components of the language --- be they formulas, terms or programs.  For example, in propositional logic the semantic function assigns a set of interpretations in which a given formula is true.  In particular, a disjunction =P v Q= is true in all interpretations in which =P= is true or =Q= is true.  Hence to a disjunction the semantic function =SEM= assigns the union of the interpretations in which =P= is true with the set of interpretations in which =Q= is true.  Similarly, to a conjunction =P & Q= the function =SEM= assigns the intersection of the set of interpretations in which =P= is true and the set of interpretations in which =Q= is true.  In an arithmetic language the semantic function =SEM= assigns numbers to terms, and to =X + Y= it assigns the sum of the numbers assigned to =X= and =Y=.  In propositional logic there are two special formulas, say =F= and =T=, which are the identity elements for conjunction and disjunction, the function =SEM= maps them onto the identity elements for union and intersection, the empty set of interpretations and the universal set of interpretations.  In arithmetic there is the numeral =0= which the function =SEM= maps onto the identity element for addition, the number zero.

#+begin_example
SEM("P v Q")  =
        the set of interpretations which is the UNION of
        SEM(P) and SEM(Q).
SEM("P & Q")  =
        the set of interpretations which is the INTERSECTION of
        SEM(P) and SEM(Q)
SEM("F")  =
        the EMPTY set of interpretations
SEM("T")  =
        the UNIVERSAL set of interpretations
SEM("X + Y")  =
        the number which is the SUM of
        SEM(X) and SEM(Y).
SEM("0")  =
        the number ZERO
#+end_example

Binary composition of functions is an associative operation with the identity function as the left and right identity; together they form a monoid.  For a very simple semantics, one now needs a binary operation on programs and a left and right identity such that the semantics preserves the operation and the identity; the semantic function which associates with every program a meaning then is a homomorphism.  A suitable monoid on programs consists of the binary operation of concatenation of programs as lists together with the empty list as the left and right identity.

#+begin_example
SEM("F G")  =
        the function which is the COMPOSITION of
        SEM(F) and SEM(G).
SEM("[]")  =
        the IDENTITY function
#+end_example

** The core language

This section describes the core part of the language which is implemented directly.  The other parts are built on top of this in the library.

*** /Pushing Data/:
Literals of type Boolean, character, integer and list can be pushed onto the stack just by writing them.  Strictly speaking a numeral such as =123= does not denote the number 123 but a function which takes stacks as arguments and stacks as values; for an arbitrary stack S1 as argument the function has as its value another stack S2 which is like S1 except that it has an additional item, the number 123, on top.

The two Booleans are written =true= and =false=.  Character literals consist of a single quote followed by the character or by the escape character =\= followed by the decimal ASCII value of the character.  Integers are written in decimal notation with an optional preceding unary minus.  Lists are enclosed in =[= and =]=.  As a /meta/notation we write =[X]= for the unit list whose only element is =X=, we write =[]= for the empty list, =[Xs]= for a list containing zero or more members =Xi=, and =[X Xs]= for the list containing one or more members =Xi=, with =X= as the first element.  Symbols are just letters followed by up to 15 further letters, digits and underscores.

*** /Operators/:
There are several operators on values of various types.  They are written in postfix notation and take their parameters from the stack.  Parameters are counted from the top of the stack; so the third parameter is the third item on the stack.  The three untyped operators =pop=, =dup= and =swap= take parameters of any type.

