18-minijoy.html
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> The Joy language</h2>
<div class="outline-text-2" id="text-3">
<p>
This section develops the design principles of the Joy language up to a full definition.
</p>
</div>

<div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> Design principles</h3>
<div class="outline-text-3" id="text-3-1">
<p>
In several languages, notably Lisp, Snobol and Prolog, programs and data have the same structure, as summarised by the slogan
</p>

<pre class="example">
Program  =  Data
</pre>

<p>
In addition they use internal memory which has a quite different structure.  In Joy the identification is carried one step further: the internal memory also has that same structure
</p>

<pre class="example">
Program  =  Data  =  Memory
</pre>

<p>
In Joy programs are lists, data are atoms or lists, and the working memory is a stack which is also a list.
</p>

<p>
Joy was designed to make its semantics as simple as possible.  The semantics of any language is given by a function which assigns meanings to the basic components of the language &#x2014; be they formulas, terms or programs.  For example, in propositional logic the semantic function assigns a set of interpretations in which a given formula is true.  In particular, a disjunction <code>P v Q</code> is true in all interpretations in which <code>P</code> is true or <code>Q</code> is true.  Hence to a disjunction the semantic function <code>SEM</code> assigns the union of the interpretations in which <code>P</code> is true with the set of interpretations in which <code>Q</code> is true.  Similarly, to a conjunction <code>P &amp; Q</code> the function <code>SEM</code> assigns the intersection of the set of interpretations in which <code>P</code> is true and the set of interpretations in which <code>Q</code> is true.  In an arithmetic language the semantic function <code>SEM</code> assigns numbers to terms, and to <code>X + Y</code> it assigns the sum of the numbers assigned to <code>X</code> and <code>Y</code>.  In propositional logic there are two special formulas, say <code>F</code> and <code>T</code>, which are the identity elements for conjunction and disjunction, the function <code>SEM</code> maps them onto the identity elements for union and intersection, the empty set of interpretations and the universal set of interpretations.  In arithmetic there is the numeral <code>0</code> which the function <code>SEM</code> maps onto the identity element for addition, the number zero.
</p>

<pre class="example">
SEM("P v Q")  =
        the set of interpretations which is the UNION of
        SEM(P) and SEM(Q).
SEM("P &amp; Q")  =
        the set of interpretations which is the INTERSECTION of
        SEM(P) and SEM(Q)
SEM("F")  =
        the EMPTY set of interpretations
SEM("T")  =
        the UNIVERSAL set of interpretations
SEM("X + Y")  =
        the number which is the SUM of
        SEM(X) and SEM(Y).
SEM("0")  =
        the number ZERO
</pre>

<p>
Binary composition of functions is an associative operation with the identity function as the left and right identity; together they form a monoid.  For a very simple semantics, one now needs a binary operation on programs and a left and right identity such that the semantics preserves the operation and the identity; the semantic function which associates with every program a meaning then is a homomorphism.  A suitable monoid on programs consists of the binary operation of concatenation of programs as lists together with the empty list as the left and right identity.
</p>

<pre class="example">
SEM("F G")  =
        the function which is the COMPOSITION of
        SEM(F) and SEM(G).
SEM("[]")  =
        the IDENTITY function
</pre>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> The core language</h3>
<div class="outline-text-3" id="text-3-2">
<p>
This section describes the core part of the language which is implemented directly.  The other parts are built on top of this in the library.
</p>
</div>

<div id="outline-container-sec-3-2-1" class="outline-4">
<h4 id="sec-3-2-1"><span class="section-number-4">3.2.1</span> <i>Pushing Data</i>:</h4>
<div class="outline-text-4" id="text-3-2-1">
<p>
Literals of type Boolean, character, integer and list can be pushed onto the stack just by writing them.  Strictly speaking a numeral such as <code>123</code> does not denote the number 123 but a function which takes stacks as arguments and stacks as values; for an arbitrary stack S1 as argument the function has as its value another stack S2 which is like S1 except that it has an additional item, the number 123, on top.
</p>

<p>
The two Booleans are written <code>true</code> and <code>false</code>.  Character literals consist of a single quote followed by the character or by the escape character <code>\</code> followed by the decimal ASCII value of the character.  Integers are written in decimal notation with an optional preceding unary minus.  Lists are enclosed in <code>[</code> and <code>]</code>.  As a /meta/notation we write <code>[X]</code> for the unit list whose only element is <code>X</code>, we write <code>[]</code> for the empty list, <code>[Xs]</code> for a list containing zero or more members <code>Xi</code>, and <code>[X Xs]</code> for the list containing one or more members <code>Xi</code>, with <code>X</code> as the first element.  Symbols are just letters followed by up to 15 further letters, digits and underscores.
</p>
</div>
</div>
<div id="outline-container-sec-3-2-2" class="outline-4">
<h4 id="sec-3-2-2"><span class="section-number-4">3.2.2</span> <i>Operators</i>:</h4>
<div class="outline-text-4" id="text-3-2-2">
<p>
There are several operators on values of various types.  They are written in postfix notation and take their parameters from the stack.  Parameters are counted from the top of the stack; so the third parameter is the third item on the stack.  The three untyped operators <code>pop</code>, <code>dup</code> and <code>swap</code> take parameters of any type.
</p>
</div>
</div>
