text/18-minijoy.org
*** /Combinators/: 
These are operators which expect lists on the top of the stack; they will remove them from the stack and execute them as programs.  The simplest is the =i= combinator.  It expects a list as its only mandatory parameter on the top of the stack, it removes this list and executes it as a program.  Hence it satisfies:

#+begin_example
        [Fs]  i   ==   Fs
#+end_example

Slightly more complicated is the =dip= combinator.  It expects two mandatory parameters on the top of the stack.  The second parameter can be anything.  The first parameter, topmost, has to be a list.  The =dip= combinator removes these two parameters from the stack and then executes the list as a program.  Typically the execution will change the stack.  After that, the =dip= combinator will restore what was its second parameter to the top of the now current stack.  So its principal use is to produce a change in the stack without affecting the top element.  For a data value =X=, the =dip= combinator satisfies

#+begin_example
        X  [Fs]  dip   ==   Fs  X
#+end_example

Very useful is the =step= combinator, which takes two mandatory parameters.  The second parameter has to be a list of arbitrary data values.  The first parameter, topmost, has to be a list which can be executed as a program.  The =step= combinator removes the two parameters.  Then, starting with the first element, if any, of the list of data, it pushes that datum on the stack and then executes the other list as a program.  This is repeated for each datum member of the second parameter.  If that list was empty, then the first parameter is not executed at all.  The =step= combinator satisfies

#+begin_example
        []  [Fs]  step   ==   id
        [X Xs]  [Fs]  step   ==   [X]  first  Fs  [Xs]  Fs  step
#+end_example

If X is a data value, the second line is equivalent to

#+begin_example
        [X Xs]  [Fs]  step   ==   X  Fs  [Xs]  [Fs]  step
#+end_example

There are two combinators for stepping through the elements of a list: =stepl= traverses the list from left to right, and =stepr= traverses the list from right to left.  The list to be stepped through has to be the fourth parameter on the stack.  The other three are two functions and a constant.  The third parameter has to be a function, for each element of the list it will be applied to the stack with that element topmost, and below that what was below the list.  This application will produce a value on top of the stack.  The second parameter is a constant.  For the first element of the list the produced value will now be combined with the constant using the first parameter.  For any further elements of the list the produced value will be combined with the result of the previous combination.


