18-minijoy.html
<div id="outline-container-sec-3-2-3" class="outline-4">
<h4 id="sec-3-2-3"><span class="section-number-4">3.2.3</span> <i>Combinators</i>:</h4>
<div class="outline-text-4" id="text-3-2-3">
<p>
These are operators which expect lists on the top of the stack; they will remove them from the stack and execute them as programs.  The simplest is the <code>i</code> combinator.  It expects a list as its only mandatory parameter on the top of the stack, it removes this list and executes it as a program.  Hence it satisfies:
</p>

<pre class="example">
[Fs]  i   ==   Fs
</pre>

<p>
Slightly more complicated is the <code>dip</code> combinator.  It expects two mandatory parameters on the top of the stack.  The second parameter can be anything.  The first parameter, topmost, has to be a list.  The <code>dip</code> combinator removes these two parameters from the stack and then executes the list as a program.  Typically the execution will change the stack.  After that, the <code>dip</code> combinator will restore what was its second parameter to the top of the now current stack.  So its principal use is to produce a change in the stack without affecting the top element.  For a data value <code>X</code>, the <code>dip</code> combinator satisfies
</p>

<pre class="example">
X  [Fs]  dip   ==   Fs  X
</pre>

<p>
Very useful is the <code>step</code> combinator, which takes two mandatory parameters.  The second parameter has to be a list of arbitrary data values.  The first parameter, topmost, has to be a list which can be executed as a program.  The <code>step</code> combinator removes the two parameters.  Then, starting with the first element, if any, of the list of data, it pushes that datum on the stack and then executes the other list as a program.  This is repeated for each datum member of the second parameter.  If that list was empty, then the first parameter is not executed at all.  The <code>step</code> combinator satisfies
</p>

<pre class="example">
[]  [Fs]  step   ==   id
[X Xs]  [Fs]  step   ==   [X]  first  Fs  [Xs]  Fs  step
</pre>

<p>
If X is a data value, the second line is equivalent to
</p>

<pre class="example">
[X Xs]  [Fs]  step   ==   X  Fs  [Xs]  [Fs]  step
</pre>

<p>
There are two combinators for stepping through the elements of a list: <code>stepl</code> traverses the list from left to right, and <code>stepr</code> traverses the list from right to left.  The list to be stepped through has to be the fourth parameter on the stack.  The other three are two functions and a constant.  The third parameter has to be a function, for each element of the list it will be applied to the stack with that element topmost, and below that what was below the list.  This application will produce a value on top of the stack.  The second parameter is a constant.  For the first element of the list the produced value will now be combined with the constant using the first parameter.  For any further elements of the list the produced value will be combined with the result of the previous combination.

</p>
</div>
</div>
</div>
</div>
