text/18-minijoy.org
* Theory of Joy

This section develops some aspects of a theory of the Joy language: an algebra for manipulating Joy programs by means of reduction rules, a rudimentary theory of Joy types, and a Joy interpreter written in Joy.

** Joy algebra
Let A be an alphabet of symbols ={a b ..}= which may be finite or infinite.  Strings over A are sequences of zero or more members of A.  Let a binary relation between strings be given by a set of identities of the form =S1 = T1=, =S2 = T2= and so on.  Write =S == T= for the smallest reflexive, symmetric and transitive extension of this relation which also satisfies the condition

#+begin_example
        If  S = T  then  R S U  ==  R T U
#+end_example

where =R S U= and =R T U= are concatenations having =S= and =T= somewhere in the middle.

/Example/: propositional logic in prefix notation, with just the constants 0 and 1, negation =-=, and conjunction =&=.  Consider the rewrite relation given by

#+begin_example
- 1  =  0       - 0  =  1
& 1 1  =  1     & 1 0  =  0     & 0 1  =  0     & 0 0  =  0
#+end_example

These rules may be used to evaluate formulas by rewriting, as in the following example:

#+begin_example
                & - & - 1 0 & - 0 1
        ==      & - & 0   0 & - 0 1
        ==      & - 0       & - 0 1
        ==      & 1         & - 0 1
        ==      & 1         & 1   1
        ==      & 1         1
        ==      1
#+end_example

Rewriting systems were already used in chapter 6 on operator precedence parsing.  Obviously the method works for prefix, infix and postfix notation; in particular, for postfix notation there is no need for a stack.  However, for the simplest, left to right rewriting strategy, there is a lot of time wasted, because every step requires scanning the previous string from the beginning.  For postfix notation the stack eliminates the need to scan from the beginning --- at every stage the next symbol in the string is examined, and if it is an operator it takes its parameters from the stack.  As an exercise, specify the rewriting rules for postfix, translate the above formula into postfix, evaluate the formula 1) using the rewriting rules and 2) using a stack.

Clearly the method works not only for various styles of notation but also for various types: truth values, numbers, strings, lists and other constructions.  Since there are only two truth values, it is possible to give a short list of rewriting rules for the operators.  But already for numbers an infinite collection of rewriting rules is needed.  This collection has to be specified in a finite way --- but this does not present an obstacle.  For Joy rewriting rules are needed for all data types and for the stack operations.  Here is an example:

#+begin_example
        [ 3 4 ]  2  swap  uncons  first  *  +
==      2  [ 3 4 ]  uncons  first  *  +                 (swap)
==      2  3  [ 4 ]  first  *  +                        (uncons)
==      2  3  4  *  +                                   (first)
==      2  12  +                                        (*)
==      14                                              (+)
#+end_example

In Joy there is no need for named parameters in definitions --- the mechanism of naming is replaced by stack operations and by combinators.  This is illustrated by all the functions defined in the standard library.  (Note that any variables occurring there are inside comments explaining the meaning of primitives.)

Backus (1981) argued that programming concepts should satisfy strong and clean mathematical laws.  In Joy the absence of named parameters has the consequence that his requirement holds in a rather startling way.  The following are some examples of laws that can be written in infix or in functional notation and with variables - in the left column, and can also be written in Joy notation without variables - in the right column.

#+begin_example
INFIX or FUNCTIONAL                     POSTFIX Joy
  
X + Y = Y + X                           swap +  ==  +
(X + Y) + Z) = X + (Y + Z)              [+] dip +  ==  + +
X + 0  =  X                             0 +  ==  id
P and false  =  false                   false and  ==  pop false
P or P  =  P                            dup or  ==  id
first(cons(X,L))  =  X                  cons first  ==  pop
length(reverse(L))  =  length(L)        reverse length  ==  length
#+end_example

The associativity of concatenation and its left and right identity are expressed by the first two laws below.  The third law relates the b-combinator with concatenation.  The associativity of functional composition is expressed by the fourth law.  (Henson (1987, p 258) criticises presentations of the FP-systems originally due to Backus (1978) in that they do not give a law to this effect, although they use it in proofs.)  Finally, the last law expresses that the empty program is the left and right identity of functional composition.

#+begin_example
        [concat] dip concat   ==   concat concat
        [] concat   ==   id   ==   [] swap concat
 
        b  ==  concat i
 
        [b] dip i  ==  [[i] dip] dip b
        [] b   ==   i   ==   [] swap b
#+end_example

