18-minijoy.html
<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> Theory of Joy</h2>
<div class="outline-text-2" id="text-5">
<p>
This section develops some aspects of a theory of the Joy language: an algebra for manipulating Joy programs by means of reduction rules, a rudimentary theory of Joy types, and a Joy interpreter written in Joy.
</p>
</div>

<div id="outline-container-sec-5-1" class="outline-3">
<h3 id="sec-5-1"><span class="section-number-3">5.1</span> Joy algebra</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Let A be an alphabet of symbols <code>{a b ..}</code> which may be finite or infinite.  Strings over A are sequences of zero or more members of A.  Let a binary relation between strings be given by a set of identities of the form <code>S1 = T1</code>, <code>S2 = T2</code> and so on.  Write <code>S =</code> T= for the smallest reflexive, symmetric and transitive extension of this relation which also satisfies the condition
</p>

<pre class="example">
If  S = T  then  R S U  ==  R T U
</pre>

<p>
where <code>R S U</code> and <code>R T U</code> are concatenations having <code>S</code> and <code>T</code> somewhere in the middle.
</p>

<p>
<i>Example</i>: propositional logic in prefix notation, with just the constants 0 and 1, negation <code>-</code>, and conjunction <code>&amp;</code>.  Consider the rewrite relation given by
</p>

<pre class="example">
- 1  =  0       - 0  =  1
&amp; 1 1  =  1     &amp; 1 0  =  0     &amp; 0 1  =  0     &amp; 0 0  =  0
</pre>

<p>
These rules may be used to evaluate formulas by rewriting, as in the following example:
</p>

<pre class="example">
        &amp; - &amp; - 1 0 &amp; - 0 1
==      &amp; - &amp; 0   0 &amp; - 0 1
==      &amp; - 0       &amp; - 0 1
==      &amp; 1         &amp; - 0 1
==      &amp; 1         &amp; 1   1
==      &amp; 1         1
==      1
</pre>

<p>
Rewriting systems were already used in chapter 6 on operator precedence parsing.  Obviously the method works for prefix, infix and postfix notation; in particular, for postfix notation there is no need for a stack.  However, for the simplest, left to right rewriting strategy, there is a lot of time wasted, because every step requires scanning the previous string from the beginning.  For postfix notation the stack eliminates the need to scan from the beginning &#x2014; at every stage the next symbol in the string is examined, and if it is an operator it takes its parameters from the stack.  As an exercise, specify the rewriting rules for postfix, translate the above formula into postfix, evaluate the formula 1) using the rewriting rules and 2) using a stack.
</p>

<p>
Clearly the method works not only for various styles of notation but also for various types: truth values, numbers, strings, lists and other constructions.  Since there are only two truth values, it is possible to give a short list of rewriting rules for the operators.  But already for numbers an infinite collection of rewriting rules is needed.  This collection has to be specified in a finite way &#x2014; but this does not present an obstacle.  For Joy rewriting rules are needed for all data types and for the stack operations.  Here is an example:
</p>

<pre class="example">
        [ 3 4 ]  2  swap  uncons  first  *  +
==      2  [ 3 4 ]  uncons  first  *  +                 (swap)
==      2  3  [ 4 ]  first  *  +                        (uncons)
==      2  3  4  *  +                                   (first)
==      2  12  +                                        (*)
==      14                                              (+)
</pre>

<p>
In Joy there is no need for named parameters in definitions &#x2014; the mechanism of naming is replaced by stack operations and by combinators.  This is illustrated by all the functions defined in the standard library.  (Note that any variables occurring there are inside comments explaining the meaning of primitives.)
</p>

<p>
Backus (1981) argued that programming concepts should satisfy strong and clean mathematical laws.  In Joy the absence of named parameters has the consequence that his requirement holds in a rather startling way.  The following are some examples of laws that can be written in infix or in functional notation and with variables - in the left column, and can also be written in Joy notation without variables - in the right column.
</p>

<pre class="example">
INFIX or FUNCTIONAL                     POSTFIX Joy
  
X + Y = Y + X                           swap +  ==  +
(X + Y) + Z) = X + (Y + Z)              [+] dip +  ==  + +
X + 0  =  X                             0 +  ==  id
P and false  =  false                   false and  ==  pop false
P or P  =  P                            dup or  ==  id
first(cons(X,L))  =  X                  cons first  ==  pop
length(reverse(L))  =  length(L)        reverse length  ==  length
</pre>

<p>
The associativity of concatenation and its left and right identity are expressed by the first two laws below.  The third law relates the b-combinator with concatenation.  The associativity of functional composition is expressed by the fourth law.  (Henson (1987, p 258) criticises presentations of the FP-systems originally due to Backus (1978) in that they do not give a law to this effect, although they use it in proofs.)  Finally, the last law expresses that the empty program is the left and right identity of functional composition.
</p>

<pre class="example">
[concat] dip concat   ==   concat concat
[] concat   ==   id   ==   [] swap concat
 
b  ==  concat i
 
[b] dip i  ==  [[i] dip] dip b
[] b   ==   i   ==   [] swap b
</pre>
</div>
</div>
