text/18-minijoy.org
** Joy types

In this part we develop a rudimentary theory of Joy types.

As indicated in the introduction, all Joy functions are unary functions taking a complex object as their sole parameter and yield a complex object as their value.  The complex objects consist of a stack, an input file and an output file.  Because of this, the composition of two appropriate functions is well-defined.  Furthermore, all functions are of the same type.

For many purposes this last result about types leaves out far too much.  It fails to distinguish the various data types that can be manipulated on the stack and shifted between the stack and the two files.  Clearly there are some important differences between the following:

#+begin_example
        +   concat   123   map   'A   first
#+end_example

In what follows,we shall distinguish some basic data types, to be written in capital letters: =B=(oolean), =C=(haracter), =I=(nteger) and =L=(ist).  Here are some examples:

#+begin_example
        true  :  B      'x  :  C        123  : I        [a b c]  :  L
#+end_example

We want to be able to say that the length function takes one list as parameter and produces an integer as value, and that concatenation takes two lists as parameters and produces a list as value.

Because Joy uses postfix notation, an elegant calculus of types can be developed for it.  This calculus is adapted from what are called categorial grammars, see the end of this section for some reading.  The type expressions are defined recursively as the smallest set generated under the following rules:

#+begin_example
1. Each of B, C, I and L is a type expression.
2. If X and Y are type expressions, then so are
        X Y             their concatenation
        X\Y             their left cancellation
        X/Y             their right cancellation
        [X]             the quotation of X
#+end_example

The type of the length can now be given:

#+begin_example
        length  :  L\I
#+end_example

This type assignment means that if the length function is composed with a list on its left, then the reult is of type integer.

#+begin_example
        functions:      [a b c]         length          ==      3
        types:          L               L\I             ==>     I
#+end_example

The last line is an instance of a general rewriting rule for types:

#+begin_example
                X  X\Y          ==>     Y
#+end_example

This means that the composition of two functions of the types indicated on the left of the arrow is of the type indicated on the right of the arrow.  Here are some more type assignments:

#+begin_example
        concat  :  L\L\L
        +       :  I\I\I
        cons    :  X\L\L
        i       :  [X]\X
        map     :  L\[X]\L
#+end_example

The theory of Joy types needs to be developed much further.  It would be most useful in a Joy compiler.

** /Reading/:
The quotation type introduced here appears to be new.  On the other hand, the concatenation and cancellation types in this section are adapted from categorial grammars, a generating mechanism equivalent to context free grammars.

For a survey of uses of categorial grammars see the book edited by Oehrle, Bach and Wheeler (1988).  In that book the chapters by Casadio and Lambek are probably most useful for the theory of Joy types.

