18-minijoy.html
<div id="outline-container-sec-5-2" class="outline-3">
<h3 id="sec-5-2"><span class="section-number-3">5.2</span> Joy types</h3>
<div class="outline-text-3" id="text-5-2">
<p>
In this part we develop a rudimentary theory of Joy types.
</p>

<p>
As indicated in the introduction, all Joy functions are unary functions taking a complex object as their sole parameter and yield a complex object as their value.  The complex objects consist of a stack, an input file and an output file.  Because of this, the composition of two appropriate functions is well-defined.  Furthermore, all functions are of the same type.
</p>

<p>
For many purposes this last result about types leaves out far too much.  It fails to distinguish the various data types that can be manipulated on the stack and shifted between the stack and the two files.  Clearly there are some important differences between the following:
</p>

<pre class="example">
+   concat   123   map   'A   first
</pre>

<p>
In what follows,we shall distinguish some basic data types, to be written in capital letters: =B=(oolean), =C=(haracter), =I=(nteger) and =L=(ist).  Here are some examples:
</p>

<pre class="example">
true  :  B      'x  :  C        123  : I        [a b c]  :  L
</pre>

<p>
We want to be able to say that the length function takes one list as parameter and produces an integer as value, and that concatenation takes two lists as parameters and produces a list as value.
</p>

<p>
Because Joy uses postfix notation, an elegant calculus of types can be developed for it.  This calculus is adapted from what are called categorial grammars, see the end of this section for some reading.  The type expressions are defined recursively as the smallest set generated under the following rules:
</p>

<pre class="example">
1. Each of B, C, I and L is a type expression.
2. If X and Y are type expressions, then so are
        X Y             their concatenation
        X\Y             their left cancellation
        X/Y             their right cancellation
        [X]             the quotation of X
</pre>

<p>
The type of the length can now be given:
</p>

<pre class="example">
length  :  L\I
</pre>

<p>
This type assignment means that if the length function is composed with a list on its left, then the reult is of type integer.
</p>

<pre class="example">
functions:      [a b c]         length          ==      3
types:          L               L\I             ==&gt;     I
</pre>

<p>
The last line is an instance of a general rewriting rule for types:
</p>

<pre class="example">
X  X\Y          ==&gt;     Y
</pre>

<p>
This means that the composition of two functions of the types indicated on the left of the arrow is of the type indicated on the right of the arrow.  Here are some more type assignments:
</p>

<pre class="example">
concat  :  L\L\L
+       :  I\I\I
cons    :  X\L\L
i       :  [X]\X
map     :  L\[X]\L
</pre>

<p>
The theory of Joy types needs to be developed much further.  It would be most useful in a Joy compiler.
</p>
</div>
</div>
<div id="outline-container-sec-5-3" class="outline-3">
<h3 id="sec-5-3"><span class="section-number-3">5.3</span> <i>Reading</i>:</h3>
<div class="outline-text-3" id="text-5-3">
<p>
The quotation type introduced here appears to be new.  On the other hand, the concatenation and cancellation types in this section are adapted from categorial grammars, a generating mechanism equivalent to context free grammars.
</p>

<p>
For a survey of uses of categorial grammars see the book edited by Oehrle, Bach and Wheeler (1988).  In that book the chapters by Casadio and Lambek are probably most useful for the theory of Joy types.
</p>
</div>
</div>
