text/18-minijoy.org
** A Joy interpreter written in Joy

In this section we develop a Joy interpreter written in Joy itself.  This will serve several purposes: it is an exercise in developing a Joy program, it shows how well Joy can talk about itself, and it is a basis of the Joy interpreter to be written in Pascal in the next section.

The first version is merely a reminder that Joy already has a combinator, namely the =i= combinator, which removes a program from the top of the stack and executes it.

#+begin_example
Joy0   ==   i
#+end_example

The next version makes explicit the fact that Joy programs are lists which are interpreted by stepping through the members of the list and executing each in turn, by considering them as unit size programs:

#+begin_example
Joy   ==
    [ unit i ]
    step
#+end_example

The next version has to spell out the various cases.  The select-operator and the i-combinator together perform rather like a =CASE= statement in Pascal.  The list of cases has to be pushed first.  So the next version takes the /form/:

#+begin_example
Joy   ==
    [   [ CASELIST ]
        select
        i ]
    step
#+end_example

or, still schematically:

#+begin_example
Joy   ==
    [   [   [c1 ..]
            [c2 ..]
            ... ]
        select
        i ]
    step
#+end_example

where =CASELIST= consists of a list of cases =c1=, =c2= and so on.  Clearly, among the cases to be considered are at least the primitives used in the interpreter so far:

1) the =select= operation,
2) pushing a list or program, and 
3) two combinators, the =step= combinator and the i-combinator.  It is best to consider the =select= operation first.  It has to be handled like most other operations =P=: to interpret =P= which is on top of the stack, the primitive =P= has to be popped, and then the primitive operation =P= has to be executed.  This gives the following case for the =select= operation:

#+begin_example
            [ select    pop select ]
#+end_example

This means that when the interpreter sees the select operation as the second item on the stack, and the current list of cases as the first, topmost, element, then it will replace the list with the rest of that case, which is =[pop select]=.  The =i= combinator executes this, which has the consequence of =pop=ping the =select= operator which is now on top of the stack.  Then the =select= operation is executed, as required.  As can be seen, the interpreter will also have to use the =pop= primitive, and therefore it will also have to implement it:

#+begin_example
            [ pop       pop pop ]
#+end_example

To push a list or program, the interpreter has to leave it there, because executing such a push operation produces precisely the required result.  The =select= operation used in the interpreter only looks at the type of something, so the empty list can serve as the sample list:

#+begin_example
            [ [] ]                              (* lists        *)
#+end_example

Finally, the =step= and =i= combinators.  It would be possible to treat them just like operators:

#+begin_example
            [ step      pop step ]
            [ i         pop i ]
#+end_example

However, this would mean that the interpreter only interprets top level programs, but of course it should descend right down into all levels.  What is needed is a way for the combinators to use the Joy interpreter that is being written now.  So, when the =step= combinator is being executed, having a program =[Ps]= as a parameter, the =step= combinator should encounter a program which will eventually call the Joy interpreter recursively, but first push =[Ps]=.  So it has to execute

#+begin_example
            [ [Ps] Joy ]  step
#+end_example

The way to do this is to construct the above program from what is on top of the stack when the interpreter sees the =step= combinator.  First, the =step= combinator is popped off.  Now =[Ps]= is on top of the stack.  Second, the unit program =[Joy]= is pushed.  Then the two are =cons='ed together to yield =[[Ps] Joy]=.  If this is ever executed, it will push =[Ps]= and then use Joy to interpret it.  It will be executed as many times as there are elements in the list below, and the execution is under the control of the =step= combinator.  For uniformity the same method is used for the =i= combinator, although it would be possible for it to just call the Joy interpreter recursively.

#+begin_example
            [ step      pop [Joy] cons step ]
            [ i         pop [Joy] cons i ]
#+end_example

The last two cases have used the =cons= operation, so the interpreter has to be able to handle this operation, too.

#+begin_example
            [ cons      pop cons ]
#+end_example

Here then is a complete but minimalist version of Joy-in-Joy:

#+begin_example
Joy   ==
    [   [   [ [] ]
            [ pop       pop pop ]
            [ select    pop select ]
            [ cons      pop cons ]
            [ step      pop [Joy] cons step ]
            [ i         pop [Joy] cons i ] ]
        select
        i ]
    step
#+end_example

This is not universal yet, what is still needed are two stack operations =swap= and =dup=, one list destructor =uncons=, and one combinator =dip=:

#+begin_example
            [ swap      pop swap ]
            [ dup       pop dup ]
            [ uncons    pop uncons ]
            [ dip       pop [Joy] cons dip ]
#+end_example

The final version is actually part of the library, as an included file:

#+begin_example
(* the JOY interpreter written in JOY                           *)

joy     ==
    [   [
                                                (* PUSH DATA:   *)
            [ nothing ]                         (* type void    *)
            [ false ]                           (* Booleans     *)
            [ 'A ]                              (* characters   *)
            [ 0 ]                               (* numbers      *)
            [ [] ]                              (* lists        *)

                                                (* OPERATIONS:  *)
            [ pop       pop pop ]
            [ dup       pop dup ]
            [ swap      pop swap ]
            [ cons      pop cons ]
            [ uncons    pop uncons ]
            [ select    pop select ]
            [ *         pop * ]
            [ +         pop + ]
            [ -         pop - ]
            [ /         pop / ]
            [ and       pop and ]
            [ or        pop or ]
            [ not       pop not ]
            [ body      pop body ]
            [ put       pop put ]
            [ get       pop get ]
                                                (* COMBINATORS: *)
            [ i         pop [joy] cons i ]
            [ dip       pop [joy] cons dip ]
            [ step      pop [joy] cons step ]
                                                (* DEFINED      *)
            [ joy       body joy ]  ]
        select
        i ]
    step                                                         ;
#+end_example

It is this version that is used as the basis of the Joy interpreter written in Pascal in the next section.


* The implementation

