18-minijoy.html
<div id="outline-container-sec-5-4" class="outline-3">
<h3 id="sec-5-4"><span class="section-number-3">5.4</span> A Joy interpreter written in Joy</h3>
<div class="outline-text-3" id="text-5-4">
<p>
In this section we develop a Joy interpreter written in Joy itself.  This will serve several purposes: it is an exercise in developing a Joy program, it shows how well Joy can talk about itself, and it is a basis of the Joy interpreter to be written in Pascal in the next section.
</p>

<p>
The first version is merely a reminder that Joy already has a combinator, namely the <code>i</code> combinator, which removes a program from the top of the stack and executes it.
</p>

<pre class="example">
Joy0   ==   i
</pre>

<p>
The next version makes explicit the fact that Joy programs are lists which are interpreted by stepping through the members of the list and executing each in turn, by considering them as unit size programs:
</p>

<pre class="example">
Joy   ==
    [ unit i ]
    step
</pre>

<p>
The next version has to spell out the various cases.  The select-operator and the i-combinator together perform rather like a <code>CASE</code> statement in Pascal.  The list of cases has to be pushed first.  So the next version takes the <i>form</i>:
</p>

<pre class="example">
Joy   ==
    [   [ CASELIST ]
        select
        i ]
    step
</pre>

<p>
or, still schematically:
</p>

<pre class="example">
Joy   ==
    [   [   [c1 ..]
            [c2 ..]
            ... ]
        select
        i ]
    step
</pre>

<p>
where <code>CASELIST</code> consists of a list of cases <code>c1</code>, <code>c2</code> and so on.  Clearly, among the cases to be considered are at least the primitives used in the interpreter so far:
</p>

<ol class="org-ol">
<li>the <code>select</code> operation,
</li>
<li>pushing a list or program, and 
</li>
<li>two combinators, the <code>step</code> combinator and the i-combinator.  It is best to consider the <code>select</code> operation first.  It has to be handled like most other operations <code>P</code>: to interpret <code>P</code> which is on top of the stack, the primitive <code>P</code> has to be popped, and then the primitive operation <code>P</code> has to be executed.  This gives the following case for the <code>select</code> operation:
</li>
</ol>

<pre class="example">
[ select    pop select ]
</pre>

<p>
This means that when the interpreter sees the select operation as the second item on the stack, and the current list of cases as the first, topmost, element, then it will replace the list with the rest of that case, which is <code>[pop select]</code>.  The <code>i</code> combinator executes this, which has the consequence of <code>pop=ping the =select</code> operator which is now on top of the stack.  Then the <code>select</code> operation is executed, as required.  As can be seen, the interpreter will also have to use the <code>pop</code> primitive, and therefore it will also have to implement it:
</p>

<pre class="example">
[ pop       pop pop ]
</pre>

<p>
To push a list or program, the interpreter has to leave it there, because executing such a push operation produces precisely the required result.  The <code>select</code> operation used in the interpreter only looks at the type of something, so the empty list can serve as the sample list:
</p>

<pre class="example">
[ [] ]                              (* lists        *)
</pre>

<p>
Finally, the <code>step</code> and <code>i</code> combinators.  It would be possible to treat them just like operators:
</p>

<pre class="example">
[ step      pop step ]
[ i         pop i ]
</pre>

<p>
However, this would mean that the interpreter only interprets top level programs, but of course it should descend right down into all levels.  What is needed is a way for the combinators to use the Joy interpreter that is being written now.  So, when the <code>step</code> combinator is being executed, having a program <code>[Ps]</code> as a parameter, the <code>step</code> combinator should encounter a program which will eventually call the Joy interpreter recursively, but first push <code>[Ps]</code>.  So it has to execute
</p>

<pre class="example">
[ [Ps] Joy ]  step
</pre>

<p>
The way to do this is to construct the above program from what is on top of the stack when the interpreter sees the <code>step</code> combinator.  First, the <code>step</code> combinator is popped off.  Now <code>[Ps]</code> is on top of the stack.  Second, the unit program <code>[Joy]</code> is pushed.  Then the two are <code>cons</code>'ed together to yield <code>[[Ps] Joy]</code>.  If this is ever executed, it will push <code>[Ps]</code> and then use Joy to interpret it.  It will be executed as many times as there are elements in the list below, and the execution is under the control of the <code>step</code> combinator.  For uniformity the same method is used for the <code>i</code> combinator, although it would be possible for it to just call the Joy interpreter recursively.
</p>

<pre class="example">
[ step      pop [Joy] cons step ]
[ i         pop [Joy] cons i ]
</pre>

<p>
The last two cases have used the <code>cons</code> operation, so the interpreter has to be able to handle this operation, too.
</p>

<pre class="example">
[ cons      pop cons ]
</pre>

<p>
Here then is a complete but minimalist version of Joy-in-Joy:
</p>

<pre class="example">
Joy   ==
    [   [   [ [] ]
            [ pop       pop pop ]
            [ select    pop select ]
            [ cons      pop cons ]
            [ step      pop [Joy] cons step ]
            [ i         pop [Joy] cons i ] ]
        select
        i ]
    step
</pre>

<p>
This is not universal yet, what is still needed are two stack operations <code>swap</code> and <code>dup</code>, one list destructor <code>uncons</code>, and one combinator <code>dip</code>:
</p>

<pre class="example">
[ swap      pop swap ]
[ dup       pop dup ]
[ uncons    pop uncons ]
[ dip       pop [Joy] cons dip ]
</pre>

<p>
The final version is actually part of the library, as an included file:
</p>

<pre class="example">
(* the JOY interpreter written in JOY                           *)

joy     ==
    [   [
                                                (* PUSH DATA:   *)
            [ nothing ]                         (* type void    *)
            [ false ]                           (* Booleans     *)
            [ 'A ]                              (* characters   *)
            [ 0 ]                               (* numbers      *)
            [ [] ]                              (* lists        *)

                                                (* OPERATIONS:  *)
            [ pop       pop pop ]
            [ dup       pop dup ]
            [ swap      pop swap ]
            [ cons      pop cons ]
            [ uncons    pop uncons ]
            [ select    pop select ]
            [ *         pop * ]
            [ +         pop + ]
            [ -         pop - ]
            [ /         pop / ]
            [ and       pop and ]
            [ or        pop or ]
            [ not       pop not ]
            [ body      pop body ]
            [ put       pop put ]
            [ get       pop get ]
                                                (* COMBINATORS: *)
            [ i         pop [joy] cons i ]
            [ dip       pop [joy] cons dip ]
            [ step      pop [joy] cons step ]
                                                (* DEFINED      *)
            [ joy       body joy ]  ]
        select
        i ]
    step                                                         ;
</pre>

<p>
It is this version that is used as the basis of the Joy interpreter written in Pascal in the next section.

</p>
</div>
</div>
</div>
