text/18-minijoy.org
** /Declarations/:
The program makes use of the utilities from Chapter 17 almost everywhere.  Therefore the utilities have to be processed by the Pascal compiler before the program proper can be processed.  But the utilities are not entirely stand alone, they require several previously declared labels, constants and even two types: symbols and standard identifiers.  Only after these have been declared can the file containing the utilities be included.  After that file has been processed, anything in the utilities is accessible.  Then follow any declarations specific to Joy: constants, types, variables, procedures and functions, and then the main program.  Hence the program has this structure:

#+begin_example
PROGRAM minJoy(input,output);
LABEL, CONST, TYPE declarations needed for utilities
INCLUDE utilities
CONST, TYPE, VAR, PROCEDURE, FUNCTION needed for Joy
BEGIN (* main *)
 ..
END.
#+end_example

** /Data Structures/:
Apart from what is provided in the utilities, there are two main data structures: The first is a table of identifiers together with a code address.  The second is an array of code nodes, consisting of an opcode, a value and a next field --- all used by the program proper, but also a Boolean flag needed for the garbage collector.  There are several registers pointing into the code.  One of these is the freelist of linked nodes that are known not to be in use otherwise.  When the program needs a new node, it calls a procedure to provide one; normally it is taken from the freelist.  If the freelist has become empty, then garbage collection occurs, and hopefully the freelist will be replenished.  The garbage collector is described in detail at the end of this section.

** /Main/:
The main program begins by calling an initialisation procedure whose body consists of calls to procedures in the utilities: one call to initialise the scanner, several calls to enter the reserved symbols, and several calls to enter the standard identifiers.  Then the main program initialises the freelist: all memory cells are set to unmarked, all but the last memory cells are linked to their successor, the last cell is linked to nothing, and the freelist pointer is set to the first cell.

The main program then calls a procedure to read the library.  It is necessary to make two passes through the library: on the first pass the identifiers to be declared are read and entered sequentially into the table of user identifiers; since the lookup procedure will use a binary search through this table, it is essential that the identifiers to be declared are in alphabetical order.  On the first pass the right hand sides of the definitions are ignored.  Then the library is read a second time.  Now all identifiers can be looked up, and code can be generated for the right hand side of each definition and entered in the table for the identifier being defined.  When the library has been read, any remaining memory is available to the user.

The main program then sets the stack to empty and enters its principal read-execute loop.  It repeatedly reads a factor into its program register and then calls the Joy interpreter to execute that program.

** /The interpreter/:
The principal interpreting procedure =joy= is modelled after the Joy interpreter written in Joy that was described in the previous section.  It takes as a value parameters a (possibly zero) integer pointer to a sequence of next-linked nodes.  Its body consists of a loop which steps through this sequence, thus modelling the operation of the =step= combinator of Joy-in-Joy.  Each individual step is handled by a =CASE= statement to model what in Joy-in-Joy is the =select= operator and the =i= combinator.  The =CASE= statement examines the op-field of the given node and executes the appropriate code.

For pushing values of various types, the =konS= function is used to obtain a new node from the freelist.  For that node the op-field is the type of the value, the value-field is the integer value, and the next-field is the old stack.  For unary operations the required value is computed for a new node whose next-field is the next-field of the old stack.  Since there are quite a few binary operations, a tiny special purpose procedure can be used which pushes the required item onto the old stack with two of its top items removed.

For the combinators the interpreter has to call itself recursively.  The case for the =i= combinator pops the topmost item of the stack and executes it.  The case for the =dip= combinator is similar, except that the second item on the stack first has to be saved on the dump.  Because this saving requires a new node and hence may trigger off a garbage collection, the first item also has to be saved on the dump.  After the execution, the second item is restored from the dump onto the stack.  The case for the =step= combinator has to use a =WHILE= loop to traverse the list which is the second item on the stack.  For each element of that list, the element has to be pushed onto the stack and then the first item is executed.  The final case which results in a recursive call concerns uses of the library.  For these the required code sequence is taken from the table of user declared identifiers, the value field of the node contains the address in that table.  Hence that table does not have to be searched at run time.

Almost all the cases in the interpreter have to access value-fields and next-fields of nodes, they have to check that the nodes really exist and that they have the appropriate operator type.  This is best done by a number of checking functions local to the interpreting procedure.

