text/18-minijoy.org
** /Input and Output/:
The main program, the procedure to read the library, and also the interpreter make use of two mutually recursive procedures to read terms and factors.

The procedure for reading terms will read at least one factor, and while the next symbol is the beginning of another factor it will read a further one.  The code generated for this sequence of one or more factors has to be linked correctly.  In a =VAR= parameter the procedure returns the address of the first factor it has read, any further factors are linked to the first.

The procedure for reading factors consists essentially of a =CASE= statement which dispatches on the currently seen symbol.  Number constants and character constants simply generate a new node.  Identifiers require the lookup procedure to be called to find the address, then a new node is generated with that address as the value field.  Because the scanner handles hyphens before digits as unary minus and otherwise as a special symbol, the solitary hyphen cannot be handled together with other identifiers but needs a special case.  Finally, a left bracket signals a list; if the next symbol is the beginning of a factor, then another term is read and made the content of that list, otherwise the list is empty.  The procedure also uses a =VAR= parameter to return the address of the code for the factor it has read.

There are corresponding output procedures that are used by the interpreter and also in various places for listing, tracing and debugging.

The procedure for writing terms uses a =WHILE= loop to write zero or more factors by stepping along a list of next-linked nodes.  If there is a further factor, a space separator is written, too.

The procedure for writing factors uses a =CASE= statement to dispatch on the op-field of the node.  For characters and integers it writes the values, for Booleans it writes the appropriate identifier, for identifiers in the library it uses the value-field to index into the table of identifiers, for all others it obtains the name from the table of inbuilt standard identifiers.  For lists it writes =[= and =]= surrounding what will be written by a call to the procedure for writing terms.

Both procedures do not actually do the writing themselves but call appropriate procedures from the utilities.  This way whatever has to be written will get to the standard output file and, if a listing is being written, to the listing file.

For debugging and tracing it is useful to have another output procedure which writes the record fields of a given node to the output file and potentially to the listing file.

** /The kons function and garbage collection/:
New memory nodes are needed by the program in many places: to read the library, to read a Joy program, and when interpreting a Joy program to manipulate the stack and the dump.  Addresses of new new nodes are provided by a function =kons=, normally new nodes are taken from the freelist of linked nodes not otherwise used.  The function is similar to procedure generate in earlier programs: its parameters are essentially the fields of the record that is to be created.

When the freelist is empty, garbage collection must take place.  It is necessary to /mark/ any nodes that are pointed to directly or indirectly by the other registers: the program, the stack and the dump.  The marking consists of a recursive traversal of any so far unmarked nodes and setting the mark-bit for each node visited.  Then a single /sweep/ is made through the available memory: any nodes that are not marked are added to the freelist.  Also, in anticipation of the next garbage collection, all nodes are set back to unmarked.  The mark sweep method is the simplest of all garbage collectors, it takes only about 20 lines of code as part of the body of the =kons= function.

A good way to test a garbage collector is to exercise it (almost) to death.  In the initial development of the implementation of Joy described here only the absurdly small number of 20 memory cells was allowed for user programs in addition to what is needed for the library.  This made detailed tracing of memory usage feasible, and unfortunately it was necessary.  One of the early bugs discovered this way was the need for the garbage collector to mark not only the program-, stack- and dump-registers, but also the value- and next-parameters of the =kons= function itself.  Otherwise the execution of =swap=, =cons= and =uncons= can create unmarked cells.

** /Lookup/:
The only procedure that remains to be described is the procedure which looks up identifiers in the table.  It is called in two places in the program: when reading factors and for the second pass of the procedure which reads the library.  It first searches the table for any identifiers that might have been entered after the library has been read.  Since no order can be assumed, this first search is linear, starting with the most recent entry.  If the identifier was not found, a binary search is made through the sorted portion that was entered during the first pass through the library.  If it is still not found, a binary search is made through the table of the inbuilt primitives.  If it was not found there, it is entered as the most recent entry in the table of identifiers.  This part is not yet enabled when the library is being read.  The table of user introduced identifiers can only grow, it is never scavenged.

