text/18-minijoy.org
* The program

The following is the Pascal source file.  It is not quite standard, because it uses the utilities of the previous chapter in an included file.  If your Pascal does not allow included files, you will have to physically include that file at the point where the =INCLUDE= directive occurs, about half a page down.  If your Pascal compiler follows the original (too) strict definition of the language --- by insisting that declarations of labels, types, variables and procedures and functions occur strictly in this order --- then the declarations of the utilities and of the Joy program will have to be merged.  There are no procedures as parameters, so it should be possible to write the program in just about any version of Pascal.

#+begin_src pascal
PROGRAM minjoy(input,output);

LABEL 10,90,99;

CONST
    errormark = '%JOY';
    list_filename = '42minjoy.lst';
    reslength = 8; emptyres = '        ';
    maxrestab = 10;
    identlength = 16; emptyident = '                ';
    maxstdidenttab = 30;

TYPE
    symbol =
        (
        lbrack,rbrack,semic,period,def_equal,
        (* compulsory for scanutilities: *)
        charconst,stringconst,numberconst,
        leftparenthesis,hyphen,identifier);

    standardident =
        (lib_,mul_,add_,sub_,div_,les_,eql_,and_,body_,cns_,dip_,dup_,
         false_,get_,i_,index_,not_,nothing_,or_,pop_,put_,sty_,sel_,
         stack_,step_,stepl_,stepr_,swap_,true_,uncns_,unstack_,
         boolean_,char_,integer_,list_,unknownident);

%INCLUDE '41SCANUT.PAS'

PROCEDURE initialise;
VAR i : integer;
BEGIN (* initialise *)
iniscanner;
specials_repeat := ['=','>','.'];
erw( '.       ' ,period);
erw( ';       ' ,semic);
erw( '==      ' ,def_equal);
erw( '[       ' ,lbrack);
erw( ']       ' ,rbrack);
est( '*               ', mul_ );
est( '+               ', add_ );
est( '-               ', sub_ );
est( '/               ', div_ );
est( '<               ', les_ );
est( '=               ', eql_ );
est( 'and             ', and_ );
est( 'body            ', body_ );
est( 'cons            ', cns_ );
est( 'dip             ', dip_ );
est( 'dup             ', dup_ );
est( 'false           ', false_ );
est( 'get             ', get_ );
est( 'i               ', i_ );
est( 'index           ', index_ );
est( 'not             ', not_ );
est( 'nothing         ', nothing_ );
est( 'or              ', or_ );
est( 'pop             ', pop_ );
est( 'put             ', put_ );
est( 'sametype        ', sty_ );
est( 'select          ', sel_ );
est( 'stack           ', stack_ );
est( 'step            ', step_ );
est( 'stepl           ', stepl_ );
est( 'stepr           ', stepr_ );
est( 'swap            ', swap_ );
est( 'true            ', true_ );
est( 'uncons          ', uncns_ );
est( 'unstack         ', unstack_ );
FOR i := ord(mul_) TO ord(unstack_) DO
    IF i <> ord(stdidents[i].symb) THEN
        point('F','bad order in standard idents  ');
END; (* initialise *)

CONST
    maxtable = 300;
    maxmem = 2000;
TYPE
    memrange = 0 .. maxmem;
VAR
    table : ARRAY [1..maxtable] OF
                RECORD alf : identalfa; adr : integer END;
    lastlibloc,sentinel,lasttable,locatn : integer;
    m : ARRAY [1 .. maxmem] OF RECORD
            op : standardident; marked : boolean;
            val : integer; nxt : memrange
            END;
    i,firstusernode, freelist, programme, s(*stack*), dump : memrange;

    last_op_executed : standardident;
    stat_kons,stat_gc,stat_ops,stat_calls,
    stat_start,stat_lib : integer;

PROCEDURE lookup;
VAR i,j : integer;
BEGIN (* lookup *)
locatn := 0;
IF sentinel > 0 THEN (* library has been read *)
    BEGIN
    table[sentinel].alf := ident; locatn := lasttable;
    WHILE table[locatn].alf <> ident DO locatn := locatn - 1
    END;
IF locatn > sentinel THEN id := lib_ ELSE
    BEGIN
    i := 1; j := lastlibloc;
    REPEAT
        locatn := (i + j) div 2;
        IF ident <= table[locatn].alf THEN j := locatn - 1;
        IF ident >= table[locatn].alf THEN i := locatn + 1
        UNTIL i > j;
    IF i - 1 > j THEN id := lib_ ELSE
        BEGIN (* binary search through standard identifiers *)
        i := 1; j := laststdident;
        REPEAT
            locatn := (i + j) div 2;
            IF ident <= stdidents[locatn].alf THEN j := locatn - 1;
            IF ident >= stdidents[locatn].alf THEN i := locatn + 1
            UNTIL i > j;
        IF i - 1 > j THEN id := stdidents[locatn].symb ELSE
            IF sentinel = 0 THEN id := unknownident ELSE
                BEGIN
                lasttable := lasttable + 1;
                WITH table[lasttable] DO
                    BEGIN alf := ident; adr := 0 END;
                id := lib_; locatn := lasttable
                END;
        END; (* ELSE *)
    END; (* ELSE *)
    IF writelisting > 4 THEN
    writeln(listing,'lookup : ',id,' at ',locatn:0)
END; (* lookup *)

PROCEDURE writenode(n : memrange);

    PROCEDURE wn(VAR f : text);
    BEGIN
    WITH m[n] DO
        BEGIN
        write(f,n:5,' ',op,val,nxt,' ',marked:1);
        IF op = lib_ THEN
            WITH table[val] DO write(f,'   ',alf,adr:4);
        writeln(f)
        END
    END;

BEGIN (* writenode *)
wn(output);
IF writelisting > 0 THEN
    BEGIN write(listing,'        '); wn(listing) END
END; (* writenode *)

FUNCTION kons
    (o : standardident; v : integer; n : memrange) : memrange;
VAR i,collected : integer;

    PROCEDURE mark(n : memrange);
    BEGIN (* mark *)
    WHILE n > 0 DO
        WITH m[n] DO
            BEGIN
            IF writelisting > 4 THEN writenode(n);
            IF (op = list_) AND NOT marked THEN mark(val);
            marked := true; n := nxt
            END
    END; (* mark *)

BEGIN (* kons *)
IF freelist = 0 THEN
    BEGIN
(*
    writeln('gc, last_op_executed = ',last_op_executed);
*)
    IF writelisting > 2 THEN
        BEGIN writeident('GC start        '); writeline END;
    mark(programme); mark(s); mark(dump);
    (* mark parameters *) mark(n); IF o = list_ THEN mark(v);
    IF writelisting > 3 THEN
        BEGIN writeident('finished marking'); writeline END;
    collected := 0;
    FOR i := firstusernode TO maxmem DO
        WITH m[i] DO
            BEGIN
            IF NOT marked THEN
                BEGIN
                nxt := freelist; freelist := i;
                collected := collected + 1
                END;
            marked := false;
            IF nxt = i THEN
                point('F','internal error - selfreference');
            END;
    IF writelisting > 2 THEN
        BEGIN
        writeinteger(collected); putch(' ');
        writeident('nodes collected '); writeline
        END;
    IF freelist = 0 THEN
        point('F','dynamic memory exhausted      ');
    stat_gc := stat_gc + 1
    END;
i := freelist;
IF (o = list_) AND (v = i) THEN
    point('F','internal error - selfreference');
IF i = n THEN
    point('F','internal error - circular     ');
WITH m[i] DO
    BEGIN freelist := nxt; op := o; val := v; nxt := n END;
IF writelisting > 4 THEN writenode(i);
stat_kons := stat_kons + 1;
kons := i
END; (* kons *)

PROCEDURE readterm(VAR first : memrange); forward;

PROCEDURE readfactor(VAR where : memrange);
VAR first : memrange;
BEGIN (* readfactor *)
CASE sym OF
    lbrack :
        BEGIN
        getsym; where := kons(list_,0,0); m[where].marked := true;
        IF sym IN [lbrack,identifier,hyphen,charconst,numberconst]
            THEN BEGIN readterm(first); m[where].val := first END
        END;
    identifier :
        BEGIN lookup; where := kons(id,locatn,0) END;
    charconst :
        where := kons(char_,num,0);
    numberconst :
        where := kons(integer_,num,0);
    hyphen :
        where := kons(sub_,ord(sub_),0);
    OTHERWISE
        point('F','internal in readfactor        ');
    END; (* CASE *)
m[where].marked := true
END; (* readfactor *)

PROCEDURE readterm; (* was forward *)
VAR i,j : memrange;
BEGIN (* readterm *) (* this is LL0 *)
readfactor(first); i := first;
getsym;
WHILE sym In [lbrack,identifier,hyphen,charconst,numberconst] DO
    BEGIN readfactor(j); m[i].nxt := j; i := j; getsym END;
END; (* readterm *)

PROCEDURE writefactor(n : memrange; nl : boolean); forward;

PROCEDURE writeterm(n : memrange; nl : boolean);
BEGIN (* writeterm *)
WHILE n > 0 DO
    BEGIN
    writefactor(n,false);
    IF m[n].nxt > 0 THEN putch(' ');
    n := m[n].nxt
    END;
IF nl THEN writeline
END; (* writeterm *)

PROCEDURE writefactor; (* was forward *)
BEGIN (* writefactor *)
IF n > 0 THEN
    WITH m[n] DO
        CASE op OF
            list_ :
                BEGIN
                putch('[');
                writeterm(val,false);
                putch(']')
                END;
            boolean_ :
                IF val = 1
                    THEN writeident('true            ')
                    ELSE writeident('false           ');
            char_ :
                IF val = 13 THEN writeline ELSE putch(chr(val));
            integer_ :
                writeinteger(val);
            lib_ :
                writeident(table[val].alf);
            OTHERWISE
                writeident(stdidents[val].alf)
            END; (* CASE *)
IF nl THEN writeline
END; (* writefactor *)

PROCEDURE readlibrary;
VAR  loc,first : integer;
BEGIN (* readlibrary *)
IF writelisting > 5 THEN
    writeln(listing,'first pass through library:');
newfile('42MINJOY.LIB    ');
lastlibloc := 0;
getsym;
REPEAT
    IF writelisting > 8 THEN
        writeln(listing,'seen : ',ident);
    IF lastlibloc > 0 THEN
        IF NOT(ident > table[lastlibloc].alf) THEN
            point('F','bad order in library          ');
    lastlibloc := lastlibloc + 1;
    table[lastlibloc].alf := ident;
    REPEAT getsym UNTIL sym IN [semic,period];
    IF sym = semic THEN getsym
    UNTIL sym = period;
IF writelisting > 5 THEN
    writeln(listing,'second pass through library:');
newfile('42MINJOY.LIB    ');
REPEAT
    getsym;
    IF sym <> identifier THEN
        point('F','pass 2: identifier expected   ');
    lookup; loc := locatn; getsym;
    IF sym <> def_equal THEN
        point('F','pass 2: "==" expected         ');
    getsym;
    readterm(first); table[loc].adr := first;
    IF writelisting > 8 THEN
        BEGIN
        writeterm(first,true)
        END
    UNTIL sym = period;
firstusernode := freelist;
IF writelisting > 5 THEN
    writeln(listing,'firstusernode = ',firstusernode:0,
        ',  total memory = ',maxmem:0);
cc := ll; adjustment := -2 (* back to file "input" *)
END; (* readlibrary *)

PROCEDURE joy(node : memrange);
VAR nod,temp1,temp2 : memrange;

    PROCEDURE binary(o : standardident; v : integer);
    BEGIN s := kons(o,v,m[m[s].nxt].nxt) END;

    FUNCTION ok(x : memrange) : memrange;
    BEGIN
    IF x < 1 THEN
        point('F','null address being referenced ');
    ok := x
    END; (* ok *)

    FUNCTION o(x : memrange) : standardident;
    BEGIN o := m[ok(x)].op END;

    FUNCTION b(x : memrange) : boolean;
    BEGIN b := m[ok(x)].val > 0 END;

    FUNCTION i(x : memrange) : integer;
    BEGIN
    WITH m[ok(x)] DO
        IF op = integer_ THEN i := val ELSE
            BEGIN
            point('R','integer value required        ');
            GOTO 10
            END
    END; (* i *)

    FUNCTION l(x : memrange) : memrange;
    BEGIN
    WITH m[ok(x)] DO
        IF op = list_ THEN l := val ELSE
            BEGIN
            point('R','list value required           ');
            GOTO 10
            END
    END;

    FUNCTION n(x : memrange) : memrange;
    BEGIN
    WITH m[ok(x)] DO
        IF nxt >= 0 THEN n := nxt ELSE
            BEGIN
            point('R','negative next value           ');
            GOTO 10
            END
    END; (* n *)

    FUNCTION v(x : memrange) : integer;
    BEGIN v := m[ok(x)].val END;

BEGIN (* joy *)
nod := node;
WHILE nod > 0 DO
    WITH m[nod] DO
        BEGIN
        IF writelisting > 3 THEN
            BEGIN
            writeident('joy:            '); putch(' ');
            writefactor(nod,true)
            END;
        IF writelisting > 4 THEN
            BEGIN
            writeident('stack:          '); putch(' ');
            writeterm(s,true);
            writeident('dump:           '); putch(' ');
            writeterm(dump,true);
            END;
        last_op_executed := op;
        CASE op OF
            nothing_,char_,integer_,list_ : s := kons(op,val,s);
            true_,false_ : s := kons(boolean_,ord(op = true_),s);
            pop_ : s := n(s);
            dup_ : s := kons(o(s),v(s),s);
            swap_ :
                s := kons(o(n(s)),v(n(s)),
                          kons(o(s),v(s),n(n(s))) );
            stack_ : s := kons(list_,s,s);
            unstack_ : s := l(s);
                                                (* OPERATIONS: *)
            not_ : s := kons(boolean_,ord(NOT b(s)),n(s));
            mul_ : binary(integer_,i(n(s)) * i(s));
            add_ : binary(integer_,i(n(s)) + i(s));
            sub_ : binary(integer_,i(n(s)) - i(s));
            div_ : binary(integer_,i(n(s)) DIV i(s));
            and_ : binary(boolean_,ord(b(n(s)) AND b(s)));
            or_  : binary(boolean_,ord(b(n(s)) OR b(s)));
            les_ : IF o(s) = lib_
                     THEN binary(boolean_,ord(table[v(n(s))].alf
                                            < table[v(s)].alf))
                     ELSE binary(boolean_,ord(v(n(s)) < v(s)));
            eql_ : binary(boolean_,ord(v(n(s)) = v(s)));
            sty_ : binary(boolean_,ord(o(n(s)) = o(s)));
            cns_ :
                IF o(n(s)) = nothing_
                    THEN s := kons(list_,l(s),n(n(s)))
                    ELSE s := kons(list_,
                                   kons(o(n(s)),v(n(s)),v(s)),
                                   n(n(s)));
            uncns_ :
                IF m[s].val = 0
                    THEN s := kons(list_,0,
                                   kons(nothing_,ord(nothing_),
                                        n(s)))
                    ELSE s := kons(list_,n(l(s)),
                                   kons(o(l(s)),m[l(s)].val,
                                        n(s)));
            sel_ :
                BEGIN
                temp1 := l(s);
                WHILE o(l(temp1)) <> o(n(s))
                    DO temp1 := n(temp1);
                s := kons(list_,n(l(temp1)),n(s))
                END;
            index_ :
                IF v(n(s)) < 1 THEN
                    s := kons(o(l(s)),v(l(s)),n(n(s)))
                ELSE
                    s := kons(o(n(l(s))),v(n(l(s))),n(n(s)));
            body_ : s := kons(list_,table[v(s)].adr,n(s));
            put_ : BEGIN writefactor(s,false); s := m[s].nxt END;
            get_ :
                BEGIN
                getsym; readfactor(temp1);
                s := kons(o(temp1),v(temp1),s)
                END;
                                                (* COMBINATORS: *)
            i_ :
                BEGIN
                temp1 := s;
                s := n(s);
                joy(l(temp1))
                END;
            dip_ :
                BEGIN
                dump := kons(o(n(s)),v(n(s)),dump);
                dump := kons(list_,l(s),dump);
                s := n(n(s));
                joy(l(dump));
                dump := n(dump);
                s := kons(o(dump),v(dump),s);
                dump := n(dump);
                END;
            step_ :
                BEGIN
                dump := kons(o(s),l(s),dump);
                dump := kons(o(n(s)),l(n(s)),dump);
                temp1 := l(s);
                temp2 := l(n(s));
                s := n(n(s));
                WHILE temp2 > 0 DO
                    WITH m[temp2] DO
                        BEGIN
                        s := kons(op,val,s);
                        joy(temp1);
                        temp2 := nxt
                        END;
                dump := n(n(dump))
                END;
            lib_ : joy(table[val].adr);
            OTHERWISE
                point('F','internal error in interpreter ')
            END; (* CASE *)
        stat_ops := stat_ops + 1;
        nod := nxt
        END; (* WITH, WHILE *)
stat_calls := stat_calls + 1
END; (* joy *)

PROCEDURE writestatistics(VAR f : text);
BEGIN
writeln(f,stat_lib:0,' milliseconds CPU to read library');
writeln(f,clock - stat_lib:0,' milliseconds CPU to execute');
writeln(f,maxmem - firstusernode:0,' user nodes available');
writeln(f,stat_gc:0,' garbage collections');
writeln(f,stat_kons:0,' nodes used');
writeln(f,stat_calls:0,' calls to joy interpreter');
writeln(f,stat_ops:0,' operations executed');
END; (* writestatistics *)

BEGIN (* main *)
stat_start := clock;
initialise;
FOR i := 1 TO maxmem DO
    WITH m[i] DO
        BEGIN marked := false; nxt := i + 1 END;
freelist := 1; m[maxmem].nxt := 0;
writelisting := 0;
stat_kons := 0; stat_gc := 0; stat_ops := 0; stat_calls := 0;
sentinel := 0; readlibrary;
stat_lib := clock - stat_start;
IF writelisting > 2 THEN
    FOR i := 1 TO lastlibloc DO
        WITH table[i] DO
            BEGIN
            writeln(listing,'"',alf,'" :');
            writeterm(adr,true);
            END;
sentinel := lastlibloc + 1; lasttable := sentinel; s := 0; dump := 0;
10:
REPEAT
    getsym;
    IF sym <> period THEN
        BEGIN
        last_op_executed := get_;
        programme := 0; readfactor(programme);
        IF writelisting > 2 THEN
            BEGIN
            writeident('interpreting:   '); writeline;
            writefactor(programme,true);
            END;
        IF dump <> 0 THEN
            BEGIN
            writeln('dump error: should be empty!');
            writeterm(dump,true);
            dump := 0
            END;
        outlinelength := 0;
        joy(m[programme].val);
        IF writelisting > 0 THEN
            IF outlinelength > 0 THEN writeline;
        IF writelisting > 2 THEN
            BEGIN
            writeident('stack:          '); writeline;
            writeterm(s,true);
            END;
        END (* IF *)
    UNTIL sym = period;
90: finalise;
99: ;
IF statistics > 0 THEN
    BEGIN
    writestatistics(output);
    IF writelisting > 0 THEN writestatistics(listing)
    END;
END.
#+end_src

