18-minijoy.html
<div id="outline-container-sec-7" class="outline-2">
<h2 id="sec-7"><span class="section-number-2">7</span> The program</h2>
<div class="outline-text-2" id="text-7">
<p>
The following is the Pascal source file.  It is not quite standard, because it uses the utilities of the previous chapter in an included file.  If your Pascal does not allow included files, you will have to physically include that file at the point where the <code>INCLUDE</code> directive occurs, about half a page down.  If your Pascal compiler follows the original (too) strict definition of the language &#x2014; by insisting that declarations of labels, types, variables and procedures and functions occur strictly in this order &#x2014; then the declarations of the utilities and of the Joy program will have to be merged.  There are no procedures as parameters, so it should be possible to write the program in just about any version of Pascal.
</p>

<div class="org-src-container">

<pre class="src src-pascal"><span style="color: #00ffff;">PROGRAM</span> <span style="color: #ffffff; font-weight: bold;">minjoy</span>(input,output);

LABEL 10,90,99;

<span style="color: #ff00ff;">CONST</span>
    errormark = <span style="color: #00ff00;">'%JOY'</span>;
    list_filename = <span style="color: #00ff00;">'42minjoy.lst'</span>;
    reslength = 8; emptyres = <span style="color: #00ff00;">'        '</span>;
    maxrestab = 10;
    identlength = 16; emptyident = <span style="color: #00ff00;">'                '</span>;
    maxstdidenttab = 30;

<span style="color: #ff00ff;">TYPE</span>
    symbol =
        (
        lbrack,rbrack,semic,period,def_equal,
        <span style="color: #66f;">(* </span><span style="color: #66f;">compulsory for scanutilities: *)</span>
        charconst,stringconst,numberconst,
        leftparenthesis,hyphen,identifier);

    standardident =
        (lib_,mul_,add_,sub_,div_,les_,eql_,and_,body_,cns_,dip_,dup_,
         false_,get_,i_,index_,not_,nothing_,or_,pop_,put_,sty_,sel_,
         stack_,step_,stepl_,stepr_,swap_,true_,uncns_,unstack_,
         boolean_,char_,integer_,list_,unknownident);

%INCLUDE <span style="color: #00ff00;">'41SCANUT.PAS'</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">initialise</span>;
<span style="color: #ff00ff;">VAR</span> i : <span style="color: #ff00ff;">integer</span>;
<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">initialise *)</span>
iniscanner;
specials_repeat := [<span style="color: #00ff00;">'='</span>,<span style="color: #00ff00;">'&gt;'</span>,<span style="color: #00ff00;">'.'</span>];
erw( <span style="color: #00ff00;">'.       '</span> ,period);
erw( <span style="color: #00ff00;">';       '</span> ,semic);
erw( <span style="color: #00ff00;">'==      '</span> ,def_equal);
erw( <span style="color: #00ff00;">'[       '</span> ,lbrack);
erw( <span style="color: #00ff00;">']       '</span> ,rbrack);
est( <span style="color: #00ff00;">'*               '</span>, mul_ );
est( <span style="color: #00ff00;">'+               '</span>, add_ );
est( <span style="color: #00ff00;">'-               '</span>, sub_ );
est( <span style="color: #00ff00;">'/               '</span>, div_ );
est( <span style="color: #00ff00;">'&lt;               '</span>, les_ );
est( <span style="color: #00ff00;">'=               '</span>, eql_ );
est( <span style="color: #00ff00;">'and             '</span>, and_ );
est( <span style="color: #00ff00;">'body            '</span>, body_ );
est( <span style="color: #00ff00;">'cons            '</span>, cns_ );
est( <span style="color: #00ff00;">'dip             '</span>, dip_ );
est( <span style="color: #00ff00;">'dup             '</span>, dup_ );
est( <span style="color: #00ff00;">'false           '</span>, false_ );
est( <span style="color: #00ff00;">'get             '</span>, get_ );
est( <span style="color: #00ff00;">'i               '</span>, i_ );
est( <span style="color: #00ff00;">'index           '</span>, index_ );
est( <span style="color: #00ff00;">'not             '</span>, not_ );
est( <span style="color: #00ff00;">'nothing         '</span>, nothing_ );
est( <span style="color: #00ff00;">'or              '</span>, or_ );
est( <span style="color: #00ff00;">'pop             '</span>, pop_ );
est( <span style="color: #00ff00;">'put             '</span>, put_ );
est( <span style="color: #00ff00;">'sametype        '</span>, sty_ );
est( <span style="color: #00ff00;">'select          '</span>, sel_ );
est( <span style="color: #00ff00;">'stack           '</span>, stack_ );
est( <span style="color: #00ff00;">'step            '</span>, step_ );
est( <span style="color: #00ff00;">'stepl           '</span>, stepl_ );
est( <span style="color: #00ff00;">'stepr           '</span>, stepr_ );
est( <span style="color: #00ff00;">'swap            '</span>, swap_ );
est( <span style="color: #00ff00;">'true            '</span>, true_ );
est( <span style="color: #00ff00;">'uncons          '</span>, uncns_ );
est( <span style="color: #00ff00;">'unstack         '</span>, unstack_ );
<span style="color: #00ffff;">FOR</span> i := ord(mul_) <span style="color: #00ffff;">TO</span> ord(unstack_) <span style="color: #00ffff;">DO</span>
    <span style="color: #00ffff;">IF</span> i &lt;&gt; ord(stdidents[i].symb) <span style="color: #00ffff;">THEN</span>
        point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'bad order in standard idents  '</span>);
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">initialise *)</span>

<span style="color: #ff00ff;">CONST</span>
    maxtable = 300;
    maxmem = 2000;
<span style="color: #ff00ff;">TYPE</span>
    memrange = 0 .. maxmem;
<span style="color: #ff00ff;">VAR</span>
    table : <span style="color: #ff00ff;">ARRAY</span> [1..maxtable] <span style="color: #00ffff;">OF</span>
                <span style="color: #ff00ff;">RECORD</span> alf : identalfa; adr : <span style="color: #ff00ff;">integer</span> <span style="color: #00ffff;">END</span>;
    lastlibloc,sentinel,lasttable,locatn : <span style="color: #ff00ff;">integer</span>;
    m : <span style="color: #ff00ff;">ARRAY</span> [1 .. maxmem] <span style="color: #00ffff;">OF</span> <span style="color: #ff00ff;">RECORD</span>
            op : standardident; marked : <span style="color: #ff00ff;">boolean</span>;
            val : <span style="color: #ff00ff;">integer</span>; nxt : memrange
            <span style="color: #00ffff;">END</span>;
    i,firstusernode, freelist, programme, s<span style="color: #66f;">(*</span><span style="color: #66f;">stack*)</span>, dump : memrange;

    last_op_executed : standardident;
    stat_kons,stat_gc,stat_ops,stat_calls,
    stat_start,stat_lib : <span style="color: #ff00ff;">integer</span>;

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">lookup</span>;
<span style="color: #ff00ff;">VAR</span> i,j : <span style="color: #ff00ff;">integer</span>;
<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">lookup *)</span>
locatn := 0;
<span style="color: #00ffff;">IF</span> sentinel &gt; 0 <span style="color: #00ffff;">THEN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">library has been read *)</span>
    <span style="color: #00ffff;">BEGIN</span>
    table[sentinel].alf := ident; locatn := lasttable;
    <span style="color: #00ffff;">WHILE</span> table[locatn].alf &lt;&gt; ident <span style="color: #00ffff;">DO</span> locatn := locatn - 1
    <span style="color: #00ffff;">END</span>;
<span style="color: #00ffff;">IF</span> locatn &gt; sentinel <span style="color: #00ffff;">THEN</span> id := lib_ <span style="color: #00ffff;">ELSE</span>
    <span style="color: #00ffff;">BEGIN</span>
    i := 1; j := lastlibloc;
    <span style="color: #00ffff;">REPEAT</span>
        locatn := (i + j) <span style="color: #00ffff;">div</span> 2;
        <span style="color: #00ffff;">IF</span> ident &lt;= table[locatn].alf <span style="color: #00ffff;">THEN</span> j := locatn - 1;
        <span style="color: #00ffff;">IF</span> ident &gt;= table[locatn].alf <span style="color: #00ffff;">THEN</span> i := locatn + 1
        <span style="color: #00ffff;">UNTIL</span> i &gt; j;
    <span style="color: #00ffff;">IF</span> i - 1 &gt; j <span style="color: #00ffff;">THEN</span> id := lib_ <span style="color: #00ffff;">ELSE</span>
        <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">binary search through standard identifiers *)</span>
        i := 1; j := laststdident;
        <span style="color: #00ffff;">REPEAT</span>
            locatn := (i + j) <span style="color: #00ffff;">div</span> 2;
            <span style="color: #00ffff;">IF</span> ident &lt;= stdidents[locatn].alf <span style="color: #00ffff;">THEN</span> j := locatn - 1;
            <span style="color: #00ffff;">IF</span> ident &gt;= stdidents[locatn].alf <span style="color: #00ffff;">THEN</span> i := locatn + 1
            <span style="color: #00ffff;">UNTIL</span> i &gt; j;
        <span style="color: #00ffff;">IF</span> i - 1 &gt; j <span style="color: #00ffff;">THEN</span> id := stdidents[locatn].symb <span style="color: #00ffff;">ELSE</span>
            <span style="color: #00ffff;">IF</span> sentinel = 0 <span style="color: #00ffff;">THEN</span> id := unknownident <span style="color: #00ffff;">ELSE</span>
                <span style="color: #00ffff;">BEGIN</span>
                lasttable := lasttable + 1;
                <span style="color: #00ffff;">WITH</span> table[lasttable] <span style="color: #00ffff;">DO</span>
                    <span style="color: #00ffff;">BEGIN</span> alf := ident; adr := 0 <span style="color: #00ffff;">END</span>;
                id := lib_; locatn := lasttable
                <span style="color: #00ffff;">END</span>;
        <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">ELSE *)</span>
    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">ELSE *)</span>
    <span style="color: #00ffff;">IF</span> writelisting &gt; 4 <span style="color: #00ffff;">THEN</span>
    writeln(listing,<span style="color: #00ff00;">'lookup : '</span>,id,<span style="color: #00ff00;">' at '</span>,locatn:0)
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">lookup *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">writenode</span>(n : memrange);

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">wn</span>(<span style="color: #ff00ff;">VAR</span> f : text);
    <span style="color: #00ffff;">BEGIN</span>
    <span style="color: #00ffff;">WITH</span> m[n] <span style="color: #00ffff;">DO</span>
        <span style="color: #00ffff;">BEGIN</span>
        <span style="color: #00ffff;">write</span>(f,n:5,<span style="color: #00ff00;">' '</span>,op,val,nxt,<span style="color: #00ff00;">' '</span>,marked:1);
        <span style="color: #00ffff;">IF</span> op = lib_ <span style="color: #00ffff;">THEN</span>
            <span style="color: #00ffff;">WITH</span> table[val] <span style="color: #00ffff;">DO</span> <span style="color: #00ffff;">write</span>(f,<span style="color: #00ff00;">'   '</span>,alf,adr:4);
        writeln(f)
        <span style="color: #00ffff;">END</span>
    <span style="color: #00ffff;">END</span>;

<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">writenode *)</span>
wn(output);
<span style="color: #00ffff;">IF</span> writelisting &gt; 0 <span style="color: #00ffff;">THEN</span>
    <span style="color: #00ffff;">BEGIN</span> <span style="color: #00ffff;">write</span>(listing,<span style="color: #00ff00;">'        '</span>); wn(listing) <span style="color: #00ffff;">END</span>
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">writenode *)</span>

<span style="color: #00ffff;">FUNCTION</span> <span style="color: #ffffff; font-weight: bold;">kons</span>
    (o : standardident; v : <span style="color: #ff00ff;">integer</span>; n : memrange) : memrange;
<span style="color: #ff00ff;">VAR</span> i,collected : <span style="color: #ff00ff;">integer</span>;

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">mark</span>(n : memrange);
    <span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">mark *)</span>
    <span style="color: #00ffff;">WHILE</span> n &gt; 0 <span style="color: #00ffff;">DO</span>
        <span style="color: #00ffff;">WITH</span> m[n] <span style="color: #00ffff;">DO</span>
            <span style="color: #00ffff;">BEGIN</span>
            <span style="color: #00ffff;">IF</span> writelisting &gt; 4 <span style="color: #00ffff;">THEN</span> writenode(n);
            <span style="color: #00ffff;">IF</span> (op = list_) <span style="color: #00ffff;">AND</span> <span style="color: #00ffff;">NOT</span> marked <span style="color: #00ffff;">THEN</span> mark(val);
            marked := true; n := nxt
            <span style="color: #00ffff;">END</span>
    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">mark *)</span>

<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">kons *)</span>
<span style="color: #00ffff;">IF</span> freelist = 0 <span style="color: #00ffff;">THEN</span>
    <span style="color: #00ffff;">BEGIN</span>
<span style="color: #66f;">(*</span>
<span style="color: #66f;">    writeln('gc, last_op_executed = ',last_op_executed);</span>
<span style="color: #66f;">*)</span>
    <span style="color: #00ffff;">IF</span> writelisting &gt; 2 <span style="color: #00ffff;">THEN</span>
        <span style="color: #00ffff;">BEGIN</span> writeident(<span style="color: #00ff00;">'GC start        '</span>); writeline <span style="color: #00ffff;">END</span>;
    mark(programme); mark(s); mark(dump);
    <span style="color: #66f;">(* </span><span style="color: #66f;">mark parameters *)</span> mark(n); <span style="color: #00ffff;">IF</span> o = list_ <span style="color: #00ffff;">THEN</span> mark(v);
    <span style="color: #00ffff;">IF</span> writelisting &gt; 3 <span style="color: #00ffff;">THEN</span>
        <span style="color: #00ffff;">BEGIN</span> writeident(<span style="color: #00ff00;">'finished marking'</span>); writeline <span style="color: #00ffff;">END</span>;
    collected := 0;
    <span style="color: #00ffff;">FOR</span> i := firstusernode <span style="color: #00ffff;">TO</span> maxmem <span style="color: #00ffff;">DO</span>
        <span style="color: #00ffff;">WITH</span> m[i] <span style="color: #00ffff;">DO</span>
            <span style="color: #00ffff;">BEGIN</span>
            <span style="color: #00ffff;">IF</span> <span style="color: #00ffff;">NOT</span> marked <span style="color: #00ffff;">THEN</span>
                <span style="color: #00ffff;">BEGIN</span>
                nxt := freelist; freelist := i;
                collected := collected + 1
                <span style="color: #00ffff;">END</span>;
            marked := false;
            <span style="color: #00ffff;">IF</span> nxt = i <span style="color: #00ffff;">THEN</span>
                point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'internal error - selfreference'</span>);
            <span style="color: #00ffff;">END</span>;
    <span style="color: #00ffff;">IF</span> writelisting &gt; 2 <span style="color: #00ffff;">THEN</span>
        <span style="color: #00ffff;">BEGIN</span>
        writeinteger(collected); putch(<span style="color: #00ff00;">' '</span>);
        writeident(<span style="color: #00ff00;">'nodes collected '</span>); writeline
        <span style="color: #00ffff;">END</span>;
    <span style="color: #00ffff;">IF</span> freelist = 0 <span style="color: #00ffff;">THEN</span>
        point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'dynamic memory exhausted      '</span>);
    stat_gc := stat_gc + 1
    <span style="color: #00ffff;">END</span>;
i := freelist;
<span style="color: #00ffff;">IF</span> (o = list_) <span style="color: #00ffff;">AND</span> (v = i) <span style="color: #00ffff;">THEN</span>
    point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'internal error - selfreference'</span>);
<span style="color: #00ffff;">IF</span> i = n <span style="color: #00ffff;">THEN</span>
    point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'internal error - circular     '</span>);
<span style="color: #00ffff;">WITH</span> m[i] <span style="color: #00ffff;">DO</span>
    <span style="color: #00ffff;">BEGIN</span> freelist := nxt; op := o; val := v; nxt := n <span style="color: #00ffff;">END</span>;
<span style="color: #00ffff;">IF</span> writelisting &gt; 4 <span style="color: #00ffff;">THEN</span> writenode(i);
stat_kons := stat_kons + 1;
kons := i
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">kons *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">readterm</span>(<span style="color: #ff00ff;">VAR</span> first : memrange); <span style="color: #00ffff;">forward</span>;

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">readfactor</span>(<span style="color: #ff00ff;">VAR</span> where : memrange);
<span style="color: #ff00ff;">VAR</span> first : memrange;
<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">readfactor *)</span>
<span style="color: #00ffff;">CASE</span> sym <span style="color: #00ffff;">OF</span>
    lbrack :
        <span style="color: #00ffff;">BEGIN</span>
        getsym; where := kons(list_,0,0); m[where].marked := true;
        <span style="color: #00ffff;">IF</span> sym <span style="color: #00ffff;">IN</span> [lbrack,identifier,hyphen,charconst,numberconst]
            <span style="color: #00ffff;">THEN</span> <span style="color: #00ffff;">BEGIN</span> readterm(first); m[where].val := first <span style="color: #00ffff;">END</span>
        <span style="color: #00ffff;">END</span>;
    identifier :
        <span style="color: #00ffff;">BEGIN</span> lookup; where := kons(id,locatn,0) <span style="color: #00ffff;">END</span>;
    charconst :
        where := kons(char_,num,0);
    numberconst :
        where := kons(integer_,num,0);
    hyphen :
        where := kons(sub_,ord(sub_),0);
    OTHERWISE
        point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'internal in readfactor        '</span>);
    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">CASE *)</span>
m[where].marked := true
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">readfactor *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">readterm</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">was forward *)</span>
<span style="color: #ff00ff;">VAR</span> i,j : memrange;
<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">readterm *)</span> <span style="color: #66f;">(* </span><span style="color: #66f;">this is LL0 *)</span>
readfactor(first); i := first;
getsym;
<span style="color: #00ffff;">WHILE</span> sym <span style="color: #00ffff;">In</span> [lbrack,identifier,hyphen,charconst,numberconst] <span style="color: #00ffff;">DO</span>
    <span style="color: #00ffff;">BEGIN</span> readfactor(j); m[i].nxt := j; i := j; getsym <span style="color: #00ffff;">END</span>;
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">readterm *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">writefactor</span>(n : memrange; nl : <span style="color: #ff00ff;">boolean</span>); <span style="color: #00ffff;">forward</span>;

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">writeterm</span>(n : memrange; nl : <span style="color: #ff00ff;">boolean</span>);
<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">writeterm *)</span>
<span style="color: #00ffff;">WHILE</span> n &gt; 0 <span style="color: #00ffff;">DO</span>
    <span style="color: #00ffff;">BEGIN</span>
    writefactor(n,false);
    <span style="color: #00ffff;">IF</span> m[n].nxt &gt; 0 <span style="color: #00ffff;">THEN</span> putch(<span style="color: #00ff00;">' '</span>);
    n := m[n].nxt
    <span style="color: #00ffff;">END</span>;
<span style="color: #00ffff;">IF</span> nl <span style="color: #00ffff;">THEN</span> writeline
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">writeterm *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">writefactor</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">was forward *)</span>
<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">writefactor *)</span>
<span style="color: #00ffff;">IF</span> n &gt; 0 <span style="color: #00ffff;">THEN</span>
    <span style="color: #00ffff;">WITH</span> m[n] <span style="color: #00ffff;">DO</span>
        <span style="color: #00ffff;">CASE</span> op <span style="color: #00ffff;">OF</span>
            list_ :
                <span style="color: #00ffff;">BEGIN</span>
                putch(<span style="color: #00ff00;">'['</span>);
                writeterm(val,false);
                putch(<span style="color: #00ff00;">']'</span>)
                <span style="color: #00ffff;">END</span>;
            boolean_ :
                <span style="color: #00ffff;">IF</span> val = 1
                    <span style="color: #00ffff;">THEN</span> writeident(<span style="color: #00ff00;">'true            '</span>)
                    <span style="color: #00ffff;">ELSE</span> writeident(<span style="color: #00ff00;">'false           '</span>);
            char_ :
                <span style="color: #00ffff;">IF</span> val = 13 <span style="color: #00ffff;">THEN</span> writeline <span style="color: #00ffff;">ELSE</span> putch(chr(val));
            integer_ :
                writeinteger(val);
            lib_ :
                writeident(table[val].alf);
            OTHERWISE
                writeident(stdidents[val].alf)
            <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">CASE *)</span>
<span style="color: #00ffff;">IF</span> nl <span style="color: #00ffff;">THEN</span> writeline
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">writefactor *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">readlibrary</span>;
<span style="color: #ff00ff;">VAR</span>  loc,first : <span style="color: #ff00ff;">integer</span>;
<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">readlibrary *)</span>
<span style="color: #00ffff;">IF</span> writelisting &gt; 5 <span style="color: #00ffff;">THEN</span>
    writeln(listing,<span style="color: #00ff00;">'first pass through library:'</span>);
newfile(<span style="color: #00ff00;">'42MINJOY.LIB    '</span>);
lastlibloc := 0;
getsym;
<span style="color: #00ffff;">REPEAT</span>
    <span style="color: #00ffff;">IF</span> writelisting &gt; 8 <span style="color: #00ffff;">THEN</span>
        writeln(listing,<span style="color: #00ff00;">'seen : '</span>,ident);
    <span style="color: #00ffff;">IF</span> lastlibloc &gt; 0 <span style="color: #00ffff;">THEN</span>
        <span style="color: #00ffff;">IF</span> <span style="color: #00ffff;">NOT</span>(ident &gt; table[lastlibloc].alf) <span style="color: #00ffff;">THEN</span>
            point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'bad order in library          '</span>);
    lastlibloc := lastlibloc + 1;
    table[lastlibloc].alf := ident;
    <span style="color: #00ffff;">REPEAT</span> getsym <span style="color: #00ffff;">UNTIL</span> sym <span style="color: #00ffff;">IN</span> [semic,period];
    <span style="color: #00ffff;">IF</span> sym = semic <span style="color: #00ffff;">THEN</span> getsym
    <span style="color: #00ffff;">UNTIL</span> sym = period;
<span style="color: #00ffff;">IF</span> writelisting &gt; 5 <span style="color: #00ffff;">THEN</span>
    writeln(listing,<span style="color: #00ff00;">'second pass through library:'</span>);
newfile(<span style="color: #00ff00;">'42MINJOY.LIB    '</span>);
<span style="color: #00ffff;">REPEAT</span>
    getsym;
    <span style="color: #00ffff;">IF</span> sym &lt;&gt; identifier <span style="color: #00ffff;">THEN</span>
        point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'pass 2: identifier expected   '</span>);
    lookup; loc := locatn; getsym;
    <span style="color: #00ffff;">IF</span> sym &lt;&gt; def_equal <span style="color: #00ffff;">THEN</span>
        point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'pass 2: "==" expected         '</span>);
    getsym;
    readterm(first); table[loc].adr := first;
    <span style="color: #00ffff;">IF</span> writelisting &gt; 8 <span style="color: #00ffff;">THEN</span>
        <span style="color: #00ffff;">BEGIN</span>
        writeterm(first,true)
        <span style="color: #00ffff;">END</span>
    <span style="color: #00ffff;">UNTIL</span> sym = period;
firstusernode := freelist;
<span style="color: #00ffff;">IF</span> writelisting &gt; 5 <span style="color: #00ffff;">THEN</span>
    writeln(listing,<span style="color: #00ff00;">'firstusernode = '</span>,firstusernode:0,
        <span style="color: #00ff00;">',  total memory = '</span>,maxmem:0);
cc := ll; adjustment := -2 <span style="color: #66f;">(* </span><span style="color: #66f;">back to file "input" *)</span>
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">readlibrary *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">joy</span>(node : memrange);
<span style="color: #ff00ff;">VAR</span> nod,temp1,temp2 : memrange;

    <span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">binary</span>(o : standardident; v : <span style="color: #ff00ff;">integer</span>);
    <span style="color: #00ffff;">BEGIN</span> s := kons(o,v,m[m[s].nxt].nxt) <span style="color: #00ffff;">END</span>;

    <span style="color: #00ffff;">FUNCTION</span> <span style="color: #ffffff; font-weight: bold;">ok</span>(x : memrange) : memrange;
    <span style="color: #00ffff;">BEGIN</span>
    <span style="color: #00ffff;">IF</span> x &lt; 1 <span style="color: #00ffff;">THEN</span>
        point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'null address being referenced '</span>);
    ok := x
    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">ok *)</span>

    <span style="color: #00ffff;">FUNCTION</span> <span style="color: #ffffff; font-weight: bold;">o</span>(x : memrange) : standardident;
    <span style="color: #00ffff;">BEGIN</span> o := m[ok(x)].op <span style="color: #00ffff;">END</span>;

    <span style="color: #00ffff;">FUNCTION</span> <span style="color: #ffffff; font-weight: bold;">b</span>(x : memrange) : <span style="color: #ff00ff;">boolean</span>;
    <span style="color: #00ffff;">BEGIN</span> b := m[ok(x)].val &gt; 0 <span style="color: #00ffff;">END</span>;

    <span style="color: #00ffff;">FUNCTION</span> <span style="color: #ffffff; font-weight: bold;">i</span>(x : memrange) : <span style="color: #ff00ff;">integer</span>;
    <span style="color: #00ffff;">BEGIN</span>
    <span style="color: #00ffff;">WITH</span> m[ok(x)] <span style="color: #00ffff;">DO</span>
        <span style="color: #00ffff;">IF</span> op = integer_ <span style="color: #00ffff;">THEN</span> i := val <span style="color: #00ffff;">ELSE</span>
            <span style="color: #00ffff;">BEGIN</span>
            point(<span style="color: #00ff00;">'R'</span>,<span style="color: #00ff00;">'integer value required        '</span>);
            <span style="color: #00ffff;">GOTO</span> <span style="color: #7fffd4;">10</span>
            <span style="color: #00ffff;">END</span>
    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">i *)</span>

    <span style="color: #00ffff;">FUNCTION</span> <span style="color: #ffffff; font-weight: bold;">l</span>(x : memrange) : memrange;
    <span style="color: #00ffff;">BEGIN</span>
    <span style="color: #00ffff;">WITH</span> m[ok(x)] <span style="color: #00ffff;">DO</span>
        <span style="color: #00ffff;">IF</span> op = list_ <span style="color: #00ffff;">THEN</span> l := val <span style="color: #00ffff;">ELSE</span>
            <span style="color: #00ffff;">BEGIN</span>
            point(<span style="color: #00ff00;">'R'</span>,<span style="color: #00ff00;">'list value required           '</span>);
            <span style="color: #00ffff;">GOTO</span> <span style="color: #7fffd4;">10</span>
            <span style="color: #00ffff;">END</span>
    <span style="color: #00ffff;">END</span>;

    <span style="color: #00ffff;">FUNCTION</span> <span style="color: #ffffff; font-weight: bold;">n</span>(x : memrange) : memrange;
    <span style="color: #00ffff;">BEGIN</span>
    <span style="color: #00ffff;">WITH</span> m[ok(x)] <span style="color: #00ffff;">DO</span>
        <span style="color: #00ffff;">IF</span> nxt &gt;= 0 <span style="color: #00ffff;">THEN</span> n := nxt <span style="color: #00ffff;">ELSE</span>
            <span style="color: #00ffff;">BEGIN</span>
            point(<span style="color: #00ff00;">'R'</span>,<span style="color: #00ff00;">'negative next value           '</span>);
            <span style="color: #00ffff;">GOTO</span> <span style="color: #7fffd4;">10</span>
            <span style="color: #00ffff;">END</span>
    <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">n *)</span>

    <span style="color: #00ffff;">FUNCTION</span> <span style="color: #ffffff; font-weight: bold;">v</span>(x : memrange) : <span style="color: #ff00ff;">integer</span>;
    <span style="color: #00ffff;">BEGIN</span> v := m[ok(x)].val <span style="color: #00ffff;">END</span>;

<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">joy *)</span>
nod := node;
<span style="color: #00ffff;">WHILE</span> nod &gt; 0 <span style="color: #00ffff;">DO</span>
    <span style="color: #00ffff;">WITH</span> m[nod] <span style="color: #00ffff;">DO</span>
        <span style="color: #00ffff;">BEGIN</span>
        <span style="color: #00ffff;">IF</span> writelisting &gt; 3 <span style="color: #00ffff;">THEN</span>
            <span style="color: #00ffff;">BEGIN</span>
            writeident(<span style="color: #00ff00;">'joy:            '</span>); putch(<span style="color: #00ff00;">' '</span>);
            writefactor(nod,true)
            <span style="color: #00ffff;">END</span>;
        <span style="color: #00ffff;">IF</span> writelisting &gt; 4 <span style="color: #00ffff;">THEN</span>
            <span style="color: #00ffff;">BEGIN</span>
            writeident(<span style="color: #00ff00;">'stack:          '</span>); putch(<span style="color: #00ff00;">' '</span>);
            writeterm(s,true);
            writeident(<span style="color: #00ff00;">'dump:           '</span>); putch(<span style="color: #00ff00;">' '</span>);
            writeterm(dump,true);
            <span style="color: #00ffff;">END</span>;
        last_op_executed := op;
        <span style="color: #00ffff;">CASE</span> op <span style="color: #00ffff;">OF</span>
            nothing_,char_,integer_,list_ : s := kons(op,val,s);
            true_,false_ : s := kons(boolean_,ord(op = true_),s);
            pop_ : s := n(s);
            dup_ : s := kons(o(s),v(s),s);
            swap_ :
                s := kons(o(n(s)),v(n(s)),
                          kons(o(s),v(s),n(n(s))) );
            stack_ : s := kons(list_,s,s);
            unstack_ : s := l(s);
                                                <span style="color: #66f;">(* </span><span style="color: #66f;">OPERATIONS: *)</span>
            not_ : s := kons(boolean_,ord(<span style="color: #00ffff;">NOT</span> b(s)),n(s));
            mul_ : binary(integer_,i(n(s)) * i(s));
            add_ : binary(integer_,i(n(s)) + i(s));
            sub_ : binary(integer_,i(n(s)) - i(s));
            div_ : binary(integer_,i(n(s)) <span style="color: #00ffff;">DIV</span> i(s));
            and_ : binary(boolean_,ord(b(n(s)) <span style="color: #00ffff;">AND</span> b(s)));
            or_  : binary(boolean_,ord(b(n(s)) <span style="color: #00ffff;">OR</span> b(s)));
            les_ : <span style="color: #00ffff;">IF</span> o(s) = lib_
                     <span style="color: #00ffff;">THEN</span> binary(boolean_,ord(table[v(n(s))].alf
                                            &lt; table[v(s)].alf))
                     <span style="color: #00ffff;">ELSE</span> binary(boolean_,ord(v(n(s)) &lt; v(s)));
            eql_ : binary(boolean_,ord(v(n(s)) = v(s)));
            sty_ : binary(boolean_,ord(o(n(s)) = o(s)));
            cns_ :
                <span style="color: #00ffff;">IF</span> o(n(s)) = nothing_
                    <span style="color: #00ffff;">THEN</span> s := kons(list_,l(s),n(n(s)))
                    <span style="color: #00ffff;">ELSE</span> s := kons(list_,
                                   kons(o(n(s)),v(n(s)),v(s)),
                                   n(n(s)));
            uncns_ :
                <span style="color: #00ffff;">IF</span> m[s].val = 0
                    <span style="color: #00ffff;">THEN</span> s := kons(list_,0,
                                   kons(nothing_,ord(nothing_),
                                        n(s)))
                    <span style="color: #00ffff;">ELSE</span> s := kons(list_,n(l(s)),
                                   kons(o(l(s)),m[l(s)].val,
                                        n(s)));
            sel_ :
                <span style="color: #00ffff;">BEGIN</span>
                temp1 := l(s);
                <span style="color: #00ffff;">WHILE</span> o(l(temp1)) &lt;&gt; o(n(s))
                    <span style="color: #00ffff;">DO</span> temp1 := n(temp1);
                s := kons(list_,n(l(temp1)),n(s))
                <span style="color: #00ffff;">END</span>;
            index_ :
                <span style="color: #00ffff;">IF</span> v(n(s)) &lt; 1 <span style="color: #00ffff;">THEN</span>
                    s := kons(o(l(s)),v(l(s)),n(n(s)))
                <span style="color: #00ffff;">ELSE</span>
                    s := kons(o(n(l(s))),v(n(l(s))),n(n(s)));
            body_ : s := kons(list_,table[v(s)].adr,n(s));
            put_ : <span style="color: #00ffff;">BEGIN</span> writefactor(s,false); s := m[s].nxt <span style="color: #00ffff;">END</span>;
            get_ :
                <span style="color: #00ffff;">BEGIN</span>
                getsym; readfactor(temp1);
                s := kons(o(temp1),v(temp1),s)
                <span style="color: #00ffff;">END</span>;
                                                <span style="color: #66f;">(* </span><span style="color: #66f;">COMBINATORS: *)</span>
            i_ :
                <span style="color: #00ffff;">BEGIN</span>
                temp1 := s;
                s := n(s);
                joy(l(temp1))
                <span style="color: #00ffff;">END</span>;
            dip_ :
                <span style="color: #00ffff;">BEGIN</span>
                dump := kons(o(n(s)),v(n(s)),dump);
                dump := kons(list_,l(s),dump);
                s := n(n(s));
                joy(l(dump));
                dump := n(dump);
                s := kons(o(dump),v(dump),s);
                dump := n(dump);
                <span style="color: #00ffff;">END</span>;
            step_ :
                <span style="color: #00ffff;">BEGIN</span>
                dump := kons(o(s),l(s),dump);
                dump := kons(o(n(s)),l(n(s)),dump);
                temp1 := l(s);
                temp2 := l(n(s));
                s := n(n(s));
                <span style="color: #00ffff;">WHILE</span> temp2 &gt; 0 <span style="color: #00ffff;">DO</span>
                    <span style="color: #00ffff;">WITH</span> m[temp2] <span style="color: #00ffff;">DO</span>
                        <span style="color: #00ffff;">BEGIN</span>
                        s := kons(op,val,s);
                        joy(temp1);
                        temp2 := nxt
                        <span style="color: #00ffff;">END</span>;
                dump := n(n(dump))
                <span style="color: #00ffff;">END</span>;
            lib_ : joy(table[val].adr);
            OTHERWISE
                point(<span style="color: #00ff00;">'F'</span>,<span style="color: #00ff00;">'internal error in interpreter '</span>)
            <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">CASE *)</span>
        stat_ops := stat_ops + 1;
        nod := nxt
        <span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">WITH, WHILE *)</span>
stat_calls := stat_calls + 1
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">joy *)</span>

<span style="color: #00ffff;">PROCEDURE</span> <span style="color: #ffffff; font-weight: bold;">writestatistics</span>(<span style="color: #ff00ff;">VAR</span> f : text);
<span style="color: #00ffff;">BEGIN</span>
writeln(f,stat_lib:0,<span style="color: #00ff00;">' milliseconds CPU to read library'</span>);
writeln(f,clock - stat_lib:0,<span style="color: #00ff00;">' milliseconds CPU to execute'</span>);
writeln(f,maxmem - firstusernode:0,<span style="color: #00ff00;">' user nodes available'</span>);
writeln(f,stat_gc:0,<span style="color: #00ff00;">' garbage collections'</span>);
writeln(f,stat_kons:0,<span style="color: #00ff00;">' nodes used'</span>);
writeln(f,stat_calls:0,<span style="color: #00ff00;">' calls to joy interpreter'</span>);
writeln(f,stat_ops:0,<span style="color: #00ff00;">' operations executed'</span>);
<span style="color: #00ffff;">END</span>; <span style="color: #66f;">(* </span><span style="color: #66f;">writestatistics *)</span>

<span style="color: #00ffff;">BEGIN</span> <span style="color: #66f;">(* </span><span style="color: #66f;">main *)</span>
stat_start := clock;
initialise;
<span style="color: #00ffff;">FOR</span> i := 1 <span style="color: #00ffff;">TO</span> maxmem <span style="color: #00ffff;">DO</span>
    <span style="color: #00ffff;">WITH</span> m[i] <span style="color: #00ffff;">DO</span>
        <span style="color: #00ffff;">BEGIN</span> marked := false; nxt := i + 1 <span style="color: #00ffff;">END</span>;
freelist := 1; m[maxmem].nxt := 0;
writelisting := 0;
stat_kons := 0; stat_gc := 0; stat_ops := 0; stat_calls := 0;
sentinel := 0; readlibrary;
stat_lib := clock - stat_start;
<span style="color: #00ffff;">IF</span> writelisting &gt; 2 <span style="color: #00ffff;">THEN</span>
    <span style="color: #00ffff;">FOR</span> i := 1 <span style="color: #00ffff;">TO</span> lastlibloc <span style="color: #00ffff;">DO</span>
        <span style="color: #00ffff;">WITH</span> table[i] <span style="color: #00ffff;">DO</span>
            <span style="color: #00ffff;">BEGIN</span>
            writeln(listing,<span style="color: #00ff00;">'"'</span>,alf,<span style="color: #00ff00;">'" :'</span>);
            writeterm(adr,true);
            <span style="color: #00ffff;">END</span>;
sentinel := lastlibloc + 1; lasttable := sentinel; s := 0; dump := 0;
10:
<span style="color: #00ffff;">REPEAT</span>
    getsym;
    <span style="color: #00ffff;">IF</span> sym &lt;&gt; period <span style="color: #00ffff;">THEN</span>
        <span style="color: #00ffff;">BEGIN</span>
        last_op_executed := get_;
        programme := 0; readfactor(programme);
        <span style="color: #00ffff;">IF</span> writelisting &gt; 2 <span style="color: #00ffff;">THEN</span>
            <span style="color: #00ffff;">BEGIN</span>
            writeident(<span style="color: #00ff00;">'interpreting:   '</span>); writeline;
            writefactor(programme,true);
            <span style="color: #00ffff;">END</span>;
        <span style="color: #00ffff;">IF</span> dump &lt;&gt; 0 <span style="color: #00ffff;">THEN</span>
            <span style="color: #00ffff;">BEGIN</span>
            writeln(<span style="color: #00ff00;">'dump error: should be empty!'</span>);
            writeterm(dump,true);
            dump := 0
            <span style="color: #00ffff;">END</span>;
        outlinelength := 0;
        joy(m[programme].val);
        <span style="color: #00ffff;">IF</span> writelisting &gt; 0 <span style="color: #00ffff;">THEN</span>
            <span style="color: #00ffff;">IF</span> outlinelength &gt; 0 <span style="color: #00ffff;">THEN</span> writeline;
        <span style="color: #00ffff;">IF</span> writelisting &gt; 2 <span style="color: #00ffff;">THEN</span>
            <span style="color: #00ffff;">BEGIN</span>
            writeident(<span style="color: #00ff00;">'stack:          '</span>); writeline;
            writeterm(s,true);
            <span style="color: #00ffff;">END</span>;
        <span style="color: #00ffff;">END</span> <span style="color: #66f;">(* </span><span style="color: #66f;">IF *)</span>
    <span style="color: #00ffff;">UNTIL</span> sym = period;
90: finalise;
99: ;
<span style="color: #00ffff;">IF</span> statistics &gt; 0 <span style="color: #00ffff;">THEN</span>
    <span style="color: #00ffff;">BEGIN</span>
    writestatistics(output);
    <span style="color: #00ffff;">IF</span> writelisting &gt; 0 <span style="color: #00ffff;">THEN</span> writestatistics(listing)
    <span style="color: #00ffff;">END</span>;
<span style="color: #00ffff;">END</span>.
</pre>
</div>
</div>
</div>
