text/18-minijoy.org
* Exercises and Reading

** /Algebra/:
Find Joy equations which express the De Morgan laws and the left and right distributive laws.  All these laws have their duals, of course.

#+begin_example
INFIX with variables                            POSTFIX Joy
 
not(P and Q)  =  not P or not Q                 and not  ==  ???
P and (Q or R)  =  P and Q or P and R           or and  ==  ???
(P or Q) and R  =  P and R or Q and R           [or] dip and  ==  ???
#+end_example

** /Self-reproducing programs/:
1) Use the algebra of Joy programs to show that

#+begin_example
        [[dup cons] dup cons] i   ==   [[dup cons] dup cons]
#+end_example

This is an example of a program =[Fs]= for which

#+begin_example
        [Fs] i   ==   [Fs]
#+end_example

In other words, if the =i= combinator finds a program of this kind on the stack and then executes it, then the execution will create that very same program on the stack.

2) Find some other programs which satisfy the same law.
3) Find programs =[Gs]= and =[Hs]= such that

#+begin_example
        [Gs] [Hs] b   ==   [Gs] [Hs]
#+end_example

4) Find programs =[Is]= =[Js]= =[Ks]= =[Ls]= =[Ms]= such that

#+begin_example
        [Is] w   ==   [Is]
        [Js] c   ==   [Js]
        [Ks] [Ls] dip   ==   [Ks] [Ls]
        [Ms] i i   ==   [Ms]   =/=   [Ms] i
#+end_example

In the last line, =\equal/\equal= means /denote different functions/.  Note that =[Ms]= is reproducing but not self-reproducing, the child is not like its parent, but the grandchild is like its grandparent.

5) Find a reproducing program such that each of its descendants is different from each of its ancestors.

6) Find a self-reproducing program =[Ns]= which is insensitive to mutilation --- where a mutilation is either removing the head (by =rest=) or removing the body (by =first=). So it should satisfy

#+begin_example
        [Ns] i  ==  [Ns] rest i  ==  [Ns] first i  ==  [Ns]
#+end_example

** /Constructing Joy-in-Joy/:
The Joy interpreter written in itself is very repetitive, the cases fall into three groups in which the members are almost alike.  Write a Joy program which is shorter than the Joy-in-Joy interpreter and which constructs one.

** /Automatic printout/:
In interactive work one frequently writes very small programs, and in order to see what has been computed one tends to write =put= at the end of every little interactive program.  This can be a nuisance.  In Lisp this is avoided by the top-level read-eval-print loop which always prints the last value that has been computed.  It is easy enough to add such a facility to the read-execute loop of Joy.  But it would be better to have the automatic printing as an option.  Design a way of making automatic printout of the top item of the stack, or even of the whole stack, an option under user control.

** /OOPS/:
In interactive work one often makes a mistake, by accidentally deleting something from the stack that was intended to be kept for later.  It would be useful be able to reset the stack to what it was before the error was made.  One way to do so is to copy the stack register to an OOPS-register before executing the next program.  Then, if a mistake did occur, a new OOPS-command could restore the stack to what it was.  Note that the OOPS-register will have to be marked by the garbage collector.  Implement such an OOPS facility.

** /Pretty Printing/:
The current output procedures just write to the output file and potentially to the listing file without any formatting.  One way of improving on this is to devise a method of indentation that makes it easier for the human reader.  A very simple method would add two columns of indentation per list; the first =[= to be written in the same line followed by one space, then the first element (if any), and the last element followed by a space and the closing =]=.  So, for example, the following is a list of three lists, of 3, 0 and 2 elements respectively:

#+begin_example
        [ [ peter
            paul
            mary ]
          [ ]
          [ smith
            jones ] ]
#+end_example

This is quite easy to implement with a recursive writing procedure which takes an indentation parameter.  However, this style uses a lot of space --- essentially there can only be only one factor per line.  The following looks much nicer:

#+begin_example
        [ [ peter paul mary ]
          []
          [ smith jones ] ]
#+end_example

or even

#+begin_example
        [ [ peter paul mary ]  []  [ smith jones ] ]
#+end_example

The difficulty is that one does not know whether to write the empty list on a new line and then to start the third list on another new line; the only way to find out whether the third list would fit on the same line is to traverse it first without actually writing it.  Study the way this problem is solved in some version of Lisp to which you have access.  Implement some pretty printer for Joy.

** /Eliminating the dump/:
In the current implementation the dump serves to save elements of the stack if they may be needed again later.  Describe at least two different implementation techniques of eliminating the dump.  Do they offer any advantages?

