18-minijoy.html
<div id="outline-container-sec-8" class="outline-2">
<h2 id="sec-8"><span class="section-number-2">8</span> Exercises and Reading</h2>
<div class="outline-text-2" id="text-8">
</div><div id="outline-container-sec-8-1" class="outline-3">
<h3 id="sec-8-1"><span class="section-number-3">8.1</span> <i>Algebra</i>:</h3>
<div class="outline-text-3" id="text-8-1">
<p>
Find Joy equations which express the De Morgan laws and the left and right distributive laws.  All these laws have their duals, of course.
</p>

<pre class="example">
INFIX with variables                            POSTFIX Joy
 
not(P and Q)  =  not P or not Q                 and not  ==  ???
P and (Q or R)  =  P and Q or P and R           or and  ==  ???
(P or Q) and R  =  P and R or Q and R           [or] dip and  ==  ???
</pre>
</div>
</div>
<div id="outline-container-sec-8-2" class="outline-3">
<h3 id="sec-8-2"><span class="section-number-3">8.2</span> <i>Self-reproducing programs</i>:</h3>
<div class="outline-text-3" id="text-8-2">
<ol class="org-ol">
<li>Use the algebra of Joy programs to show that
</li>
</ol>

<pre class="example">
[[dup cons] dup cons] i   ==   [[dup cons] dup cons]
</pre>

<p>
This is an example of a program <code>[Fs]</code> for which
</p>

<pre class="example">
[Fs] i   ==   [Fs]
</pre>

<p>
In other words, if the <code>i</code> combinator finds a program of this kind on the stack and then executes it, then the execution will create that very same program on the stack.
</p>

<ol class="org-ol">
<li>Find some other programs which satisfy the same law.
</li>
<li>Find programs <code>[Gs]</code> and <code>[Hs]</code> such that
</li>
</ol>

<pre class="example">
[Gs] [Hs] b   ==   [Gs] [Hs]
</pre>

<ol class="org-ol">
<li>Find programs <code>[Is]</code> <code>[Js]</code> <code>[Ks]</code> <code>[Ls]</code> <code>[Ms]</code> such that
</li>
</ol>

<pre class="example">
[Is] w   ==   [Is]
[Js] c   ==   [Js]
[Ks] [Ls] dip   ==   [Ks] [Ls]
[Ms] i i   ==   [Ms]   =/=   [Ms] i
</pre>

<p>
In the last line, <code>\equal/\equal</code> means <i>denote different functions</i>.  Note that <code>[Ms]</code> is reproducing but not self-reproducing, the child is not like its parent, but the grandchild is like its grandparent.
</p>

<ol class="org-ol">
<li>Find a reproducing program such that each of its descendants is different from each of its ancestors.
</li>

<li>Find a self-reproducing program <code>[Ns]</code> which is insensitive to mutilation &#x2014; where a mutilation is either removing the head (by <code>rest</code>) or removing the body (by <code>first</code>). So it should satisfy
</li>
</ol>

<pre class="example">
[Ns] i  ==  [Ns] rest i  ==  [Ns] first i  ==  [Ns]
</pre>
</div>
</div>
<div id="outline-container-sec-8-3" class="outline-3">
<h3 id="sec-8-3"><span class="section-number-3">8.3</span> <i>Constructing Joy-in-Joy</i>:</h3>
<div class="outline-text-3" id="text-8-3">
<p>
The Joy interpreter written in itself is very repetitive, the cases fall into three groups in which the members are almost alike.  Write a Joy program which is shorter than the Joy-in-Joy interpreter and which constructs one.
</p>
</div>
</div>
<div id="outline-container-sec-8-4" class="outline-3">
<h3 id="sec-8-4"><span class="section-number-3">8.4</span> <i>Automatic printout</i>:</h3>
<div class="outline-text-3" id="text-8-4">
<p>
In interactive work one frequently writes very small programs, and in order to see what has been computed one tends to write <code>put</code> at the end of every little interactive program.  This can be a nuisance.  In Lisp this is avoided by the top-level read-eval-print loop which always prints the last value that has been computed.  It is easy enough to add such a facility to the read-execute loop of Joy.  But it would be better to have the automatic printing as an option.  Design a way of making automatic printout of the top item of the stack, or even of the whole stack, an option under user control.
</p>
</div>
</div>
<div id="outline-container-sec-8-5" class="outline-3">
<h3 id="sec-8-5"><span class="section-number-3">8.5</span> <i>OOPS</i>:</h3>
<div class="outline-text-3" id="text-8-5">
<p>
In interactive work one often makes a mistake, by accidentally deleting something from the stack that was intended to be kept for later.  It would be useful be able to reset the stack to what it was before the error was made.  One way to do so is to copy the stack register to an OOPS-register before executing the next program.  Then, if a mistake did occur, a new OOPS-command could restore the stack to what it was.  Note that the OOPS-register will have to be marked by the garbage collector.  Implement such an OOPS facility.
</p>
</div>
</div>
<div id="outline-container-sec-8-6" class="outline-3">
<h3 id="sec-8-6"><span class="section-number-3">8.6</span> <i>Pretty Printing</i>:</h3>
<div class="outline-text-3" id="text-8-6">
<p>
The current output procedures just write to the output file and potentially to the listing file without any formatting.  One way of improving on this is to devise a method of indentation that makes it easier for the human reader.  A very simple method would add two columns of indentation per list; the first <code>[</code> to be written in the same line followed by one space, then the first element (if any), and the last element followed by a space and the closing <code>]</code>.  So, for example, the following is a list of three lists, of 3, 0 and 2 elements respectively:
</p>

<pre class="example">
[ [ peter
    paul
    mary ]
  [ ]
  [ smith
    jones ] ]
</pre>

<p>
This is quite easy to implement with a recursive writing procedure which takes an indentation parameter.  However, this style uses a lot of space &#x2014; essentially there can only be only one factor per line.  The following looks much nicer:
</p>

<pre class="example">
[ [ peter paul mary ]
  []
  [ smith jones ] ]
</pre>

<p>
or even
</p>

<pre class="example">
[ [ peter paul mary ]  []  [ smith jones ] ]
</pre>

<p>
The difficulty is that one does not know whether to write the empty list on a new line and then to start the third list on another new line; the only way to find out whether the third list would fit on the same line is to traverse it first without actually writing it.  Study the way this problem is solved in some version of Lisp to which you have access.  Implement some pretty printer for Joy.
</p>
</div>
</div>
<div id="outline-container-sec-8-7" class="outline-3">
<h3 id="sec-8-7"><span class="section-number-3">8.7</span> <i>Eliminating the dump</i>:</h3>
<div class="outline-text-3" id="text-8-7">
<p>
In the current implementation the dump serves to save elements of the stack if they may be needed again later.  Describe at least two different implementation techniques of eliminating the dump.  Do they offer any advantages?
</p>
</div>
</div>
