18-minijoy.html
<div id="outline-container-sec-8-8" class="outline-3">
<h3 id="sec-8-8"><span class="section-number-3">8.8</span> <i>Implementing the library directly</i>:</h3>
<div class="outline-text-3" id="text-8-8">
<p>
As explained earlier, this minimal implementation of the Joy language is intended to highlight the essentials, even at the expense of runtime efficiency.  Most of the useful operations are actually defined in the library, and their execution requires the execution of many primitives.  For example, the operation which selects the first element of a list does so by
</p>
<ol class="org-ol">
<li>unconsing the list, producing two elements, the first and the rest, then by
</li>
<li>swapping these two, so that the rest is now topmost, and then by
</li>
<li>popping the rest.
</li>
</ol>

<p>
A total of four push operations occur,when clearly just one would do.  So, having <i>first</i> not defined in the library but built in as a primitive should speed up this common operation by a factor of about three.  The same is true of just about all the operations that are defined in the library - it would be more efficient to include them as primitives.
</p>

<p>
One of the first combinators one would want to implement directly is the <code>ifte</code> combinator.  As it is currently implemented in the library, essentially by the index-operation and the <code>i</code> combinator, it is particularly inefficient: first, the <code>IF</code> part and the <code>THEN</code> part have to be swapped, which uses two nodes.  Then they have to be paired to form a list of two elements.  The pairing requires an empty list to be pushed, another one node.  Then the two parts are cons'ed into that, each requiring two nodes, a total of four.  Then the indexing operation pushes the appropriate part, another node.  Only then does the <code>i</code> combinator execute the appropriate part.  The total of eight wasted nodes could be eliminated entirely by implementing the <code>ifte</code> combinator directly.  Hence with four lines of easy Pascal one should be able to achieve a speed up by a factor of eight for this combinator.
</p>

<p>
As an exercise, select some of the operators or combinators currently defined in the library and implement them as primitives.  The chosen operations should then be commented out from the library.  It would be possible to eliminate everything from the library, and then there would be no need for the program to read it (twice) prior to each run.  However, the library would still be a useful document for the user to read, because it contains all definitions.
</p>
</div>
</div>
<div id="outline-container-sec-8-9" class="outline-3">
<h3 id="sec-8-9"><span class="section-number-3">8.9</span> <i>Sets</i>:</h3>
<div class="outline-text-3" id="text-8-9">
<p>
Joy can be usefully augmented with other data types.  Sets could be useful, even if they do not have the same generality as in Pascal.  As members of sets, just small numbers from 0 to, say, 31, a maximum of 32, would be useful.  In a typical Pascal implementation the value-field of a node can hold a 32 bit integer, and alternatively it could be made to hold a 32 bit set instead.  There will have to be a notation for literal sets, say for example {1 5 12}, which is similar to but different from the notation for literal lists.  A range notation, as in say <code>{3..5 10..20}</code> might be a good starting point.  As operations, just union and intersection would do as binary operators, and unary complementation with respect to the universal set {0..31}.  To name these operations, either new symbols could be introduced, or the symbols <code>or</code>, <code>and</code> and <code>not</code> could be made (ad hoc) <i>polymorphic</i> by <i>overloading</i> their meaning in a type sensitive manner.  Additionally there should perhaps be transfer functions which transform sets to lists and vice versa.
</p>

<p>
Larger sets would certainly be better, but they would occupy more space than the value-field can hold.  So the value field could be made to hold a pointer to a set.  But then sets have to be stored elsewhere, and separate memory management and garbage collection might have to be implemented just for that.  One alternative is to implement large sets as linked lists of 32 bit sets.
</p>
</div>
</div>
<div id="outline-container-sec-8-10" class="outline-3">
<h3 id="sec-8-10"><span class="section-number-3">8.10</span> <i>Reals</i>:</h3>
<div class="outline-text-3" id="text-8-10">
<p>
Much the same kind of decision has to be made if one wants to implement real numbers.  If reals are going to be used a great deal, then it is best to make the value-field large enough to hold a real.  Any other values will then waste some space.  If reals are only used rarely and memory is a problem, then they should be implemented in a separate area of memory with its own memory management and garbage collection.
</p>
</div>
</div>
<div id="outline-container-sec-8-11" class="outline-3">
<h3 id="sec-8-11"><span class="section-number-3">8.11</span> <i>Other memory management</i>:</h3>
<div class="outline-text-3" id="text-8-11">
<p>
The efficient use of memory in dynamic languages such as Lisp, Snobol and Prolog has been the topic of intensive research.  Two broad areas of memory management are normally distinguished: garbage collection and reference counting.
</p>

<p>
Garbage collection requires a traversal of all used nodes to mark which ones are in use.  The traversal can be either recursive, as it was done in the Joy implementation described above, or it can use a more sophisticated method of temporary pointer reversal to eliminate the need for the stack space in the recursion.  Then in a second stage the unused nodes can be collected in a free-list; this is the mark-sweep method used here.  Alternatively the used nodes can be copied to a dual area of memory from which further nodes will be taken until that is exhausted.  Then this area is marked and the needed nodes are copied to the first area.  This mark-copy method of garbage collection is particularly useful in virtual memory systems because it minimises fragmentation of memory.
</p>

<p>
Reference counters replace the mark-bit by an integer which keeps track of how many times a node is being referenced.  When that count drops to zero, the node can be recycled.  The great advantage of reference counting over garbage collection is that it works continuously.  However, the method does not work with circular structures.  Joy as described does not have circular structures, so reference counting is a candidate implementation method.  On the other hand, one might well want to add circular structures to Joy, and then one would have to resort back to garbage collection.
</p>
</div>
</div>
