text/18-minijoy.org
** /Reading/:
For a gentle exposition to functional programming using Miranda see Bird and Wadler (1988).  For an exposition using ML see Reade (1989).  A more theoretical perspective can be found in Henson (1987).  The literature on Lisp contains many small interpreters written in their own language.  Henderson (1980) develops this interpreter into a program in a more conventional sequential language.  Kamin (1990) gives Pascal implementations of small versions of many languages, including several functional languages, and of two memory management techniques: mark-copy and reference counting.  Peyton Jones (1987) discusses theoretical aspects of the compiler for Miranda.  For efficient implementations of functional languages, using their inherent parallelism, and for references to the extensive recent literature in that field, see Kelly (1989).

The language Joy was inspired by Quine (1971) and Backus (1981), who in quite different fields argue for the elimination of variables (of different kinds).  The earliest version of Joy was a (too) large implementation in Pascal, then followed much smaller ones in Prolog, Common Lisp, and, by a group of students, in C.  A large, more or less final version is described in von Thun (1997).  As all functional languages, Joy would lend itself to parallel execution, even if only by software on perhaps a transputer, but so far no attempts have been made in that direction.  A Joy chip is at most a remote possibility.

Joy is unlike any of the conventional functional languages.  The closest I have been able to find is the (virtual) machine language of CAM, the Categorical Abstract Machine in Curien (1986) and in Cousineau, Curien and Mauny (1987).  The CAM machine language is not intended for the human programmer, instead it is used as the target language for implementations of languages such as ML.  For Joy the programming language and the machine language are identical.

Any further development of the Joy language should consider the very high level combinators in Meijer, Fokkinga and Paterson (1991).  These can be used to define the more familiar combinators such as map and fold.

Later, in Chapter 21, we will see a compiler written in itself, in this chapter we have seen an interpreter written in itself.  The literature on Lisp and Prolog contains other examples of interpreters written in their own language.  The idea of writing a language processor in its own language can be carried further.  What are called /partial evaluators/ can compile interpreters into compilers; and even more mind-boggling applications are possible.  For some recent references, see Jones (1990).  There is no reason why a partial evaluator should not be written in Joy for Joy.  Another application of language processors written in their own language gives rise to the possibility of /reflection/, a mode of interpretation in which a program sometimes looks at itself rather than at the data.  This is an exciting new field, references can be found in the collection edited by Maes and Nardi (1988).

* Projects

The projects outlined in this section go well beyond the scope of mere exercises.  The first project concerns improving the efficiency of the implementation in a manner that goes deeper than the exercise suggested in the previous section.  Two others deal with extending the language so that it becomes either an imperative or a relational one.  The last section concerns a compiler for Joy.

