text/18-minijoy.org
** Improving efficiency

Even if the entire library is eliminated in favour of primitives, there is much room for optimisation.  Consider the if-then-else combinator =branch= implemented directly in Pascal as suggested in the previous section.  It expects three items on top of the stack: two executable programs, and below that one Boolean value which will determine which of the two programs will be executed.  In most applications the two programs will occur literally just before the =branch= combinator.  Hence in any simple implementation the following will occur: Some possibly complex calculation will produce the Boolean value.  Then two simple push operations will push the two programs onto the stack.  Then the =branch= combinator will pop all three items, and execute one of the two programs.  In other words, the two programs are first pushed and then immediately popped.  But this is wasteful, it would be better if the two programs were not pushed at all but attached to the =branch= combinator as parameters.  Then the calculation of the Boolean value will occur as before, then this new kind of =branch= combinator will inspect that value and execute one of its parameters.

To implement this, a special optimised version of the =branch= combinator is needed.  Since the next field of any node is already needed for linkage, only the value field is available.  It will have to be made to point to a pair of nodes, one each for the two programs.  There are two places where special treatment is necessary: in the compiling stage, where it is necessary to detect such optimisable occurrences and to generate special code, and in the interpreter, where this special code is executed.  The compiler part would need fairly dramatic redesign, since the code for pushing the two programs will have to be taken back and attached to the node for the special =branch= combinator instead.  Since the code is generated not in an array but is taken from the freelist, any back references are not available and would have to be added.  By contrast, adding a special case to the interpreter to handle the optimised =branch= combinator is quite trivial.

But there is a difficulty: if a program is to be written and executed efficiently, then two internal versions will be needed, one for writing and one for executing.  This might seem like a draconian step, but there are other reasons why one might consider this.  Take for example a simple program fragment =[ 2 3 + ]=; if this is to be written as a list with put, then it will have to be stored that way; and if it is to be evaluated with the =i= combinator or any other combinator, then it is best if the program does constant folding and replaces the =[ 2 3 + ] i= by 5.  In other words, for maximal efficiency one might trade the extra space required for increased execution speed.

As a compromise, one might consider actually changing the language: say =BRANCH [thenpart] [elsepart]=, where =BRANCH= is a binary prefix operator.

Recently there has been intensive research devoted to functional programming with infinite lists and other infinite data structures.  In this style of programming one can (pretend to) compute an infinite structure and then access arbitrary parts.  In reality the parts are only computed when they are needed.  The method of implementation used here is called /lazy/ evaluation.  For some reading, see Henderson (1980, Chapter 8), Bird and Wadler (1988, Chapters 6 and 7), and Reade (1989, Chapter 8).  To implement infinite structures and lazy evaluation would require considerable redesign of the Pascal program.  However, it may be possible to write an inefficient version of it in Joy itself.

The most dramatic increase in efficiency would be obtained by compiling Joy into some efficient language.  But for full Joy the interpreter would still be needed for handling programs such as

#+begin_example
                get  i
#+end_example

where it is not known at compile time what it is that will be read by the =get=.  So a compiler will only be able to speed up programs that are known at compile time --- and for many purposes that would be sufficient.

** An imperative version of Joy

The difference between purely functional languages and sequential or imperative or procedural languages is this: In functional languages there is no internal state which can be changed, there is no notion of change at all, programs simply evaluate expressions.  In the other languages there is an internal state --- typically a collection of variables whose values can be changed by assignments.  As described so far, Joy is a purely functional language.

There is no computational reason why Joy should not be given assignable variables.  These may but need not be declared to be of any particular type, indeed, since Joy as it stands is so weakly typed it is probably best not to introduce types for variables.  In Joy it is possible to manipulate lists of symbols, for example one can write

#+begin_example
        [ London Paris ]  [ Tokyo Djakarta ]  concat
#+end_example

or even

#+begin_example
        [ London ]  first  [ Paris Tokyo Djakarta ]  cons
#+end_example

However,

#+begin_example
        London  [ Paris Tokyo Djakarta ]  cons
#+end_example

does not have the expected effect, writing =London= does not result in a push operation, any symbols not defined in the library are just noops, denoting the identity function.  But this could be changed easily, so that it does produce a push.  On the other hand, if one were to think of symbols standing for assignable variables, then one might want the /value/ of that variable to be pushed instead.

The syntax for the assignment statement will have to distinguish the assignment position from the retrieving position.  For example, the following could be taken to have the same meaning in Pascal and in extended Joy:

#+begin_example
                Pascal                          extended Joy
                a  :=  b + c                    b c + [a] assign
                                                b c + Assign a
#+end_example

Note that =Assign= would be a unary prefix operator which takes a variable as a parameter.  Note the difference between =assign= which takes a value, computed by =+=, and (a unit list of) a variable from the stack, and =Assign= which takes a value from the stack and supplies its own variable.  The first is more flexible, since the =[a]= might have been computed; but it is quite unclear whether such flexibility is desirable.

There is another way of introducing assignment and hence change, it has been part of Lisp since its inception.  To understand it one has to distinguish between the variable, which is the name of a location in memory, and the location in memory itself.  When an assignment is being made, what is made to change or vary is not the variable but the memory location which it names.  So, if the locations could be referred to without naming them, assignments need not use variables.  Suppose the stack contains at least two elements, an arbitrary datum and a list, the list topmost.  The list is actually represented by a memory node containing a pointer to a value and a pointer to the next item.  The value and the next item in the list could be changed by assignments, for example by assigning to them the value of the datum below the list.  In Lisp these two operations are called =replaca= and =replacd=; for a good explanation of the implementation issues see MacLennan (1983, pp 379 - 381) and Henderson (1980, pp 116 and 175).

