text/18-minijoy.org
** A nondeterministic version of Joy

Joy programs denote functions taking a complex object as parameter and yielding a complex object as value.  The objects consist of at least a stack, and at least two files.

A quite different language would replace the functions by relations, and to implement them one might use backtracking.  Possibly the two files would be excluded from the backtracking.  If there are assignable variables, then two forms of assignment should be distinguished: a normal assignment and a reversible one which is undone on backtracking.

For such a language any program would denote a relation between two memories which include stacks.  Many of these relations would be the familiar Joy functions, but there could now be nondeterministic primitives: a choice operation (=OR=) and an impossible operation (=FAIL=).  Nondeterministic additions to Lisp are discussed in Henderson (1980, Chapter 7).

Another powerful addition would be the logical variables as in Prolog.
