18-minijoy.html
<div id="outline-container-sec-9-3" class="outline-3">
<h3 id="sec-9-3"><span class="section-number-3">9.3</span> A nondeterministic version of Joy</h3>
<div class="outline-text-3" id="text-9-3">
<p>
Joy programs denote functions taking a complex object as parameter and yielding a complex object as value.  The objects consist of at least a stack, and at least two files.
</p>

<p>
A quite different language would replace the functions by relations, and to implement them one might use backtracking.  Possibly the two files would be excluded from the backtracking.  If there are assignable variables, then two forms of assignment should be distinguished: a normal assignment and a reversible one which is undone on backtracking.
</p>

<p>
For such a language any program would denote a relation between two memories which include stacks.  Many of these relations would be the familiar Joy functions, but there could now be nondeterministic primitives: a choice operation (<code>OR</code>) and an impossible operation (<code>FAIL</code>).  Nondeterministic additions to Lisp are discussed in Henderson (1980, Chapter 7).
</p>

<p>
Another powerful addition would be the logical variables as in Prolog.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
